[
{"name": " SAFRA Members enjoy 1-for-1 selected Coffee Bean Ice Blended drinks till 31 March 2020\t", "start": "2020-03-12T00:00:00+08:00", "end": "2020-03-31T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/SAFRA-24-Mar-2020-300x157.jpg", "vendor": "Coffee Bean & Tea Leaf", "terms": " Quench your thirst with this 1-for-1 mSAFRA exclusive!  SAFRA Members’ Exclusive! Download the mSAFRA app to redeem your 1-for-1 The Coffee Bean &amp; Tea Leaf Singapore e-voucher! Only limited to selected small sized ice blended drinks, till 31 Mar only! While stocks last, hurry now! Download mSAFRA app (Apple App Store | Google Play Store) to enjoy 1-for-1 Coffee Bean Ice Blended drinks! Valid from 12 ​​- 31 Mar 2020 Redeem a 1-for-1 Coffee Bean Small Ice Blended drink. Choose from these flavours: The Original Mocha, The Original Vanilla, Pure Dark Chocolate, Pure Caramel or California Sunrise. Limited to 1st 2,500 redemptions at all Coffee Bean outlets except Marina Bay Sands. How to redeem: Download mSAFRA app. Click on top left-hand &lt;Menu&gt;, go to &lt;e-Voucher&gt; tab. Select the treat in your &lt;Wallet&gt; and redeem at the participating outlet. Scan QR code located at the cashier or enter 4-digit code number upon ordering/payment. Each valid SAFRA member is entitled to only 1 redemption, valid on a first-come, first-served basis, while stocks last. Website: www.coffeebean.com.sg/stores e-Voucher can be utilised at all Coffee Bean outlets except Changi Airport, Marina Bay Sands, Micron and Parkway Parade. e-Voucher must be presented at Coffee Bean outlets prior to ordering/payment to enjoy the subsidized treat. Limited to 1 redemption of small-size 1-for-1 Ice Blended Pure Dark Chocolate/California Sunrise/Pure Caramel/The Original Vanilla/The Original Mocha at all Coffee Bean outlets except Marina Bay Sands. Limited to 1 redemption per SAFRA member on a first-come, first-served basis, while stocks last. The e-Voucher must be redeemed by 31 Mar 2020 and is strictly non-transferrable, non-refundable and will not be replaced once expired or utilised. SAFRA and CBTL SG reserve the rights to amend the terms and conditions of this promotion without prior notice. Valid from 12 Mar – 31 Mar 2020. SAFRA is not an agent of the merchant. Any dispute regarding the quality or service standard must be resolved directly with the respective merchants. SAFRA will not assume any liability or responsibility for the acts of the merchants or any defects in products or services offered in the promotion.  Find your nearest The Coffee Bean &amp; Tea Leaf outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Subway: 1-for-1 sub re-opening promo at The Central @ Clarke Quay MRT on 18 March 2020\t", "start": "2020-03-18T00:00:00+08:00", "end": "2020-03-18T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/10/Subway-feat-25-Oct-2019-300x157.jpg", "vendor": "Central", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! One Day Only: Buy One, Get One FREE! Be sure to come down and join them at The Central and treat yourself to a 1-for-1 deal! See you there 😎 Only available at The Central outlet on 18 March 2020, 11am – 8pm. Buy one 6″ sub and get another free 6″ sub. Free subs will be lower price of the two subs. Visuals are for illustration purposes only.  Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Starbucks: 1-for-1 Pink Peach Creme Blossom Frappuccino® and Peach Blossom Chocolate Black Tea Latte (23 to 25 March ’20)\t", "start": "2020-03-23T00:00:00+08:00", "end": "2020-03-25T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Starbucks-feat-21-Mar-2020-300x157.jpg", "vendor": "Starbucks", "terms": "Yay, an exclusive 1-for-1 treat is coming. Enjoy a 1 -FOR-1 treat on all Venti-sized Pink Peach Creme Blossom Frappuccino® and Peach Blossom Chocolate Black Tea Latte. Valid 23 – 25 Mar (Mon – Wed), 11am – 10pm Redeemable when you pay with your Starbucks Card. *Redeemable when you pay with your Starbucks Card. Valid from 23 – 25 Mar 2020 (Mon-Wed), 11am – 10pm only on Venti-sized Pink Peach Crème Blossom Frappuccino® and Peach Blossom Chocolate Black Tea Latte (hot, iced or blended) at all Starbucks Singapore stores (except for stores located at Changi Airport including Jewel). Limited to one voucher per member, each voucher for a one-time use only. Limited to 1 redemption per transaction. Offer is while stocks last. Offer is exclusive to your Starbucks account and is non-transferable. Not valid on Mobile Order &amp; Pay, delivery orders or with any other promotions or privileges. Other terms and conditions apply.  Savor the blossoming notes of Spring in Starbucks’ new beverages, available from 9 March at all outlets island-wide. Bask in the spirit of Spring with the Starbucks Pink Peach Crème Blossom Frappuccino®. This pretty-in-pink drink is a luscious blend of pink peach sauce and cream, layered with juicy peach jelly and topped with fluffy whipped cream and a delicately placed blossom-shaped meringue. Embodying the comforting springtime and the awakening of sweet blossoms, Starbucks Peach Blossom Chocolate Black Tea Latte is here to remind you that Spring has arrived. A smooth blend of creamy chocolate black tea and delightful pink peach sauce is artfully topped with whipped cream and a lovely blossom-shaped meringue to complete this peach perfect goodness. Enjoy it either hot, iced or blended – or try it all three ways to really embrace the Spring season.  Find your nearest Starbucks store here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Delifrance’s 1 for 1 classic sandwiches deals returns from 24 – 27 March 2020\t", "start": "2020-03-24T00:00:00+08:00", "end": "2020-03-27T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Delifrances-feat-23-Mar-2020-300x158.jpg", "vendor": "Delifrance", "terms": "Enjoy 1 for 1 on classic sandwiches from 12pm to 8pm from 24th – 27th March! Delight in flavours of the Egg D’vine, Chicken D’light, Tuna D’licious and Seafood D’sire. Hurry down to your nearest outlet now: www.delifrance.com.sg/storelocations *T&amp;Cs apply Limited to 3 sets per customer, charge on the higher value item. While stocks last.  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Adidas S’pore online store is offering free shipping with no min spend or purchase till 31 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Adidas-9-Mar-2020-300x157.jpg", "terms": "Adidas store at www.adidas.com.sg is currently offering free shipping on all orders for the entire month of March, with no minimum spend. Valid until 31st March 2020 No minimum purchase required. Applied automatically at checkout. Free Shipping ends 31st March 2020. Visit www.adidas.com.sg to shop now Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Department Stores, Online Stores, Online Major Sales Events Events "},
{"name": " KFC Delivery: 1-for-1 Zinger burger with DBS/POSB cards till 20 April 2020\t", "start": "2020-03-23T00:00:00+08:00", "end": "2020-04-20T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/KFC-23-Mar-2020-300x157.jpg", "vendor": "KFC Delivery", "terms": "Enjoy 1-for-1 Zinger when you order KFC Delivery with DBS/POSB cards Limited to the first 8,700 redemptions and 1 redemption per transaction only. Applicable to KFC Delivery online orders only. Not valid for KFC SG Facebook Messenger or KFC Delivery Call-in orders.. Full payment must be made with DBS PayLah! or DBS/POSB Cards. DBS General Promotion Terms &amp; Conditions apply, visit 1 for 1 Zinger [DBS/POSB Credit/Debit Card] Offer is valid for the first 8,700 redemption till 20 April 2020, or while stocks last. Limited to 1 redemption per transaction. Valid for KFC Delivery only. KFC Delivery minimum order &amp; surcharge applies. Full payment must be made with DBS or POSB credit/debit card, excluding AMEX cards. Not valid with other promo codes, offers and discounts. 1 for 1 Zinger [DBS PayLah] Offer is valid for the first 8,700 redemption till 20 April 2020, or while stocks last. Limited to 1 redemption per transaction. Valid for KFC Delivery only. KFC Delivery minimum order &amp; surcharge applies. Full payment must be made with DBS PayLah! Not valid with other promo codes, offers and discounts.   Order KFC Delivery now here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " SUKI-YA: 1-for-1 Shabu Shabu dinner at Kallang Wave Mall from 16 – 22 March 2020 ", "start": "2020-03-16T00:00:00+08:00", "end": "2020-03-22T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/04/SUKIYA-3-faet-15-Apr-2019-300x154.jpg", "vendor": "Kallang Wave", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Always looking forward to the unlimited waves of shabu-shabu meat to the table?  Look no further and head down to Suki-Ya Kallang Wave Mall this week! Valid at Suki-Ya Kallang Wave Mall only. Offer is valid with a minimum purchase of a free-flow drink per diner. Offer is valid only for buffet, but not valid with additional add-ons or a la carte drinks (e.g. beer, sake, water). Dinner is priced at S$24.90++ per pair from Monday to Thursday and S$27.90++ per pair on Friday to Sunday. This “House of Hot Pot” is designed to offer heart-warming dining experiences at equally affordable prices. Diners enjoy unlimited, top-quality chilled beef and pork in paper-thin slices and farmed chicken that are oh-so-delicious in their own right. Another highlight of Suki-Ya is its vegetable bar featuring a wide variety of fresh vegetables to round up the meal with a healthy touch. Along with sumptuous soups and broths, dining at Suki-Ya is bound to perk up everyone’s taste buds! (Photos below for illustration purpose)     Check out the 2020 menu and pricing below   Terms &amp; conditions Valid at Suki-Ya Kallang Wave Mall only. Offer is valid with a minimum purchase of a free-flow drink per diner. Offer is valid only for buffet, but not valid with additional add-ons or a la carte drinks (e.g. beer, sake, water). Dinner is priced at S$24.90++ per pair from Monday to Thursday and S$27.90++ per pair on Friday to Sunday. Offer is limited to 60 minutes dining period, a maximum of two redemptions (four pax) per bill/table. No splitting of bill/table allowed. Only walk-ins are accepted. Valid for dine-in only; no takeaways. Outlet details KALLANG WAVE MALL 1 Stadium Place #01-35 Singapore 397628 Tel: 6702 1752 OPENING HOURS: Daily: 11.30am to 9:00pm  Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Xing Fu Tang to offer 1-for-1 selected drinks at Takashimaya from 16 – 18 March 2020\t", "start": "2020-03-16T00:00:00+08:00", "end": "2020-03-18T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Xing-Fu-Tang-feat-12-Mar-2020-300x153.jpg", "vendor": "Ngee Ann City", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Takashimaya exclusive 1-for-1 deal for Xing Fu Tang. Thirsty for Boba? Here’s some great news! Xing Fu Tang at Takashimaya, Food Village, B2 will be having 1-for-1 promos from Mon 16 Mar to Wed 18 Mar 2020 for selected drinks! Promo drinks featured are: Mon 16 Mar: Brown Sugar Boba Milk Tue 17 Mar: Brown Sugar Boba Milk Tea Wed 18 Mar: Brown Sugar Boba Oolong Milk Tea Satisfy your cravings — see you at Food Village, B2!  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Delifrance has a 1-FOR-1 French Butter Croissant deal on Qoo10 (From 17 March 2020)\t", "start": "2020-03-17T00:00:00+08:00", "end": "2020-04-05T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Delifrance-feat-17-Mar-2020-300x157.jpg", "vendor": "Qoo10", "terms": "1 FOR 1 Butter Croissant. Baked freshly using the finest French butter, flour, and the authentic French style baking process, they have a uniquely French aroma that cannot be matched by others. Terms &amp; Conditions: Valid till 30 Apr 2020. Redemption at Delifrance Outlets. Check in-store on availability. Q-Price: S$6.40 Time Sale Price: S$2.90   For more info and to buy, visit the deal page at www.qoo10.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Delifrance to offer 1-for-1 classic sandwiches from 17th – 20th March 2020\t", "start": "2020-03-17T00:00:00+08:00", "end": "2020-03-20T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Delifrance-feat-16-Mar-2020-300x157.jpg", "vendor": "Delifrance", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Here’s a treat for you! Enjoy 1 for 1 on classic sandwiches from 12pm to 8pm from 17th – 20th March! Delight in flavours of the Egg D’vine, Chicken D’light, Tuna D’licious and Seafood D’sire. Hurry down to your nearest outlet now Limited to 3 sets per customer, charge on the higher value item. While stocks last.  Find your nearest outlet here Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Starbucks: Enjoy 1-for-1 on French Hazelnut Macchiato, Chocolate Chip Frappuccino® and Dark Mocha Frappuccino® (16 to 20 Mar)\t", "start": "2020-03-16T00:00:00+08:00", "end": "2020-03-20T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Starbucks-feat-15-Mar-2020-300x157.jpg", "vendor": "Starbucks", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! A treat for you. ENJOY a 1-for-1 treat* on all Venti-sized French Hazelnut Macchiato, Chocolate Chip Frappuccino®’ and Dark Mocha Frappuccino’® from 16- 20 Mar (Mon – Fri) Redeemable when you pay with your Starbucks Card.  *Redeemable when you pay with your Starbucks Card. Valid from 16 to 20 Mar 2020 (Mon-Fri) on Venti-sized French Hazelnut Macchiato (hot, iced or blended), Chocolate Chip Frappuccino® (blended) and Dark Mocha Frappuccino® (blended) at all Starbucks Singapore stores (except for stores located at Changi Airport including Jewel). Limited to three vouchers per member, each voucher for a one-time use only. Limited to 1 redemption per transaction. Offer is while stocks last. Offer is exclusive to your Starbucks account and is non-transferable. Not valid on Mobile Order &amp; Pay, delivery orders or with any other promotions or privileges. Other terms and conditions apply. Topped with velvety foam and hints of toasty-sweet hazelnut, French Hazelnut Macchiato offers a combination of freshly steamed milk and luscious hazelnut syrup marked with dark espresso to create a sweet and satisfying rush of flavors. Available as a hot, blended or iced handcrafted beverage. $7.60 (Tall, Hot &amp; Iced) $8.20 (Tall, Frappuccino)  Find your nearest Starbucks store here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Emirates: 7% – 13% off fares promo code for UOB cardholders valid till 31 December 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/06/Emirates-4-Jun-2016-300x161.jpg", "terms": "Save on Emirates flights with UOB cards. UOB cardholders enjoy Up to 13% off flights (SIN-MEL)13% off Flex Fares for Business and Economy Class Cabins10% off Saver Fares for Business and Economy Class Cabins Up to 11% all other destinations11% off Flex Fares for Business and Economy Class Cabins7% off Saver Fares for Business and Economy Class Cabins Booking period: 1 Jan to 31 Dec 2020 Travel period: 1 Jan 2020 to 31 Mar 2021 Use code SGUOB01 when booking to enjoy Head over to www.emirates.com/sg/uob to book today! T&amp;Cs apply. For more info, click here Book your hotels online at much less than over-the-counter rates. Popular online hotel booking services include Hotels.com www.Hotels.com, Expedia www.expedia.com.sg and Agoda www.agoda.com Share this with your friends &amp; family members on Facebook! For more information on Emirates, visit www.emirates.com/sg.  ", "category": "Airlines, Flights, Air Fares, Seats, Tickets Events "},
{"name": " McDonald’s: FREE Mocha or Caramel Frappe® with any purchase (minimum 80¢ only) from 13 – 15 March 2020\t", "start": "2020-03-13T00:00:00+08:00", "end": "2020-03-15T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/McDonalds-12-Mar-2020-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Free Mocha or Caramel Frappe® with any purchase via McDonald’s App This deal is only valid from 13 – 15 March 2020 12pm – 4am, while stocks last. Limited to one redemption per transaction.  Mocha Chip Frappé (left). A balanced blend of rich, roasted coffee, dark chocolate and a hint of vanilla – all topped with whipped cream, chocolate powder and chocolate drizzle Caramel Frappé (right), A blend of rich, dark roast coffee balanced with buttery caramel and a hint of vanilla; topped with whipped cream and caramel drizzle. Sweet dreams are made of these! Note: Deal may not be available at all outlets, check app for detailed info Deal is valid from 6-15 March 2020, from 12 noon – 4am, Friday, Saturday, and Sunday only, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. Deal is valid with a minimum purchase of $0.80. This deal may not be used in conjunction with any other promotions or discounts. Valid at all stores in Singapore except LIDO, institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again, until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg/ allergens-listing Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  For more info, click here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " The Manhattan FISH MARKET is offering Buddy 1-for-1 deals at all outlets from 14 – 17 March 2020\t", "start": "2020-03-14T00:00:00+08:00", "end": "2020-03-17T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/The-Manhattan-FISH-4-Feb-2020-300x160.jpg", "vendor": "Manhattan Fish Market", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! The Manhattan FISH MARKE has heard you so Buddy 1 for 1 is back by popular demand! So head over to The Manhattan FISH MARKET and enjoy 1 for 1 from 14 – 17 Mar with your buddy 🙂 Share the joy of chowing down on delicious seafood, battered fish, crispy chips and grilled goodness at up to $15.90++! *Sides and presentation may vary for new concept outlets at Causeway Point and Northpoint outlet. Product and presentation may vary due to the different concept at Causeway Point and Northpoint City. Dory’n Chips x Seafood Aglio Olio Dory’n Chips x Grilled Glory Dory Dory’n Chips x Baked Dory Valid at all outlets. Food presentation and items may vary for Northpoint and Causeway Point outlet due to different concept. No changing of items is allowed. All prices quoted are in Singapore Dollars and are subject to 7% GST. All pictures shown are for illustration purpose only. Actual product may vary due to product enhancement.   Find your nearest Manhattan FISH MARKET outlet here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Enjoy 1-for-1 admission to Zoo, River Safari, Night Safari & Jurong Bird Park this March school holidays ", "start": "2020-03-13T00:00:00+08:00", "end": "2020-03-24T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Zoo-feat-11-Mar-2020-300x158.jpg", "vendor": "wild", "terms": "Enjoy 1-for-1 admission and a $2 retail voucher with every paid ticket this March school holidays! UPDATE 21 March: Extended till 31 March UPDATE 24 March: In support of the government’s call for social distancing, the 1-for-1 promotion is no longer available With lighter crowds, there’s no better time to take in the sunshine and natural setting at the wildlife parks. Promotion is applicable for local residents only. Valid with every purchase of full priced ticket for same park and same day admission from 13 – 22 March 2020. Promotion is applicable for both online and on-site purchases Valid for Singaporeans, PRs, employment pass holders, dependent pass and long-term visit pass holders. Ticket can be in any combination of adult or child ticket (i.e 2 adult tickets, 1 adult &amp; 1 child ticket, 2 child tickets) where the higher priced ticket will be chargeable. Promotion tickets can be converted to membership; but must be converted to Friends of Wildlife (FOW) or same-park membership AND in the combination of the promotion purchased, i.e. a 1 adult + 1 child bundle must be converted to 1 adult + 1 child membership only.  Buy your tickets online here. For full terms and conditions, click here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Places of Interest, Entertainment, Tourist Attractions, Movies "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Enjoy 1-for-1 admission to Science Centre, Butterflies Up-Close, Laser Maze Challenge, Snow City & KidsSTOP (3 to 22 March 2020)\t", "start": "2020-03-03T00:00:00+08:00", "end": "2020-03-22T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Science-Centre-4-Mar-2020-300x158.jpg", "vendor": "Science Centre", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Enjoy 1-for-1 admission! Take the chance to discover all the latest exhibitions and participate in workshops and activities on health and safety. The promotion* will be available on the new online ticketing platform www.gevme.com/scsonlinetickets. Simply purchase two or more admission tickets* to any of the participating attractions below to enjoy 50% off your total purchase: Science Centre Singapore** Butterflies Up-Close (Hall D) Laser Maze Challenge (Hall A) KidsSTOP™** Snow City*** *Terms &amp; Conditions apply *Promotion is not extended to Omni-Theatre admission. **Promotion is only applicable for peak period ticket purchase to Science Centre Singapore and KidsSTOP on weekends, public as well as school holidays. ***Promotion is only applicable to 1hr Snowplay Session at Snow City. *Guests may top-up to purchase ice bumper car ride tokens at the Snow City ticketing counter upon visit. Ice bumper car rides are sold at $5 for one play, $9 for two plays and $12 for three plays. Kindly refer to the We Love Singapore FAQ (Featured image from Science Centre Facebook) Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Places of Interest, Entertainment, Tourist Attractions, Movies "},
{"name": " Adidas S’pore online store is offering free shipping with no min spend or purchase till 31 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Adidas-9-Mar-2020-300x157.jpg", "terms": "Adidas store at www.adidas.com.sg is currently offering free shipping on all orders for the entire month of March, with no minimum spend. Valid until 31st March 2020 No minimum purchase required. Applied automatically at checkout. Free Shipping ends 31st March 2020. Visit www.adidas.com.sg to shop now Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Department Stores, Online Stores, Online Major Sales Events Events "},
{"name": " Charles & Keith is having a sale with up to 50% off selected women’s bags, shoes and accessories, plus kids’ fashion (From 17 Feb) ", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/Charles-Keith-5-Sep-2019-300x158.jpg", "terms": "Get ready to stock up because it’s a pretty amazing line-up.. Valid as of 2 March 2020 Enjoy up to 50% off selected styles at www.charleskeith.com/sg. Shop a wide range of styles at the sale. Enjoy up to 50% OFF women’s bags, shoes and accessories, plus kids’ fashion. Charles &amp; Keith is also taking an additional 10% OFF sale items with a minimum purchase of two or more items. Promotion starts on 17 February 2020, 0000 hours (GMT +8). Available online and in selected stores at IMM, City Square Mall, Anchorpoint, Citylink Mall, Marina Square, Velocity@Novena, Bedok Mall, Tampines Mall, Waterway Point only. While stocks last. Check out the offers now at www.charleskeith.com/sg Free Standard Delivery is valid with purchases S$40 and above, in a single order made at CHARLESKEITH.COM. Promotion is not applicable in any CHARLES &amp; KEITH retail or departmental store. Promotion is valid for a limited time only. Shipping &amp; handling charges do not qualify towards the minimum purchase. Shipping &amp; handling charges will automatically be deducted for eligible orders at checkout. Visit the Shipping &amp; Tracking page for more information. FREE RETURNS. Try them on in the comfort of your own home and if you’re disappointed with your purchase, return the item(s) to Charles &amp; Keith within 30 days of receiving your order. Visit www.charleskeith.com/sg for more info Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fashion, Branded Apparel, Wallets, Accessories Footwear, Shoes, Slippers, Sneakers, Sandals Handbags "},
{"name": " Agoda: StanChart cards enjoy Up to 75% off + additional 7% off worldwide when you book by 30 Apr 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/08/Agoda-Logo-17-Aug-2016-300x148.jpg", "terms": "Book with Standard Chartered credit cards to enjoy savings at www.agoda.com/sc.  Up to 75% off + additional 7% off worldwide for Standard Chartered Cardmembers! Book now at www.agoda.com/sc. Terms &amp; Conditions For more info, visit www.agoda.com/sc. Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Credit Cards, Prepaid Cards, Banks Events Vacations, Travel Deals, Cruises, Luggage Bags, Equipment, Hotels "},
{"name": " McDonald’s will be offering 1-for-1 Sausage McMuffin® with Egg from 9 – 12 March 2020\t", "start": "2020-03-09T00:00:00+08:00", "end": "2020-03-12T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/Sausage-McMuffin®-with-Egg-2-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Sausage McMuffin® with Egg® via McDonald’s App   This deal is only valid from 9 – 12 March 2020, while stocks last. Sausage McMuffin® with Egg®. Sumptuous chicken sausage and an egg done sunny side-up served between perfectly toasted muffins. Note: Deal may not be available at all outlets, check app for detailed info  Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.   For more info, click here. Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " GODIVA 1-for-1 Chocolate Twist Soft Serve promotion to return at all outlets from 6 – 7 March 2020\t", "start": "2020-03-06T00:00:00+08:00", "end": "2020-03-07T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/GODIVAs-feat-5-Mar-2020-300x155.jpg", "vendor": "GODIVA", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Get GODIVA Chocolate Twist Soft Serve at 1-for-1 this Friday (6 Mar) and Saturday (7 Mar)! Available at the following timings: 11.30am to 2.30pm 4.30pm to 7.30pm *Please allow some slight difference in serving timing to ensure better crowd and quality control. GODIVA thanks you for your kind understanding. Usual price of one Soft Serve is $9.  Terms &amp; conditions Promotion is only valid on 6 and 7 March 2020 Applicable to Twist Chocolate Soft Serve Cone only Not valid with VIP privileges &amp; other promotions Available while stocks last Slight difference in stated serving timing may occur Picture is for reference only In case of disputes, the decision of Godiva Chocolatier (Asia) Limited shall be final and binding Find your nearest outlet here (Bugis Junction, ION, Raffles City, Suntec City, Takashimaya) Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " SUKI-YA: 1-for-1 Shabu Shabu dinner at Tampines Mall from 9 – 12 March 2020\t", "start": "2020-03-09T00:00:00+08:00", "end": "2020-03-12T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/04/SUKIYA-3-faet-15-Apr-2019-300x154.jpg", "vendor": "Tampines Mall", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! SUKI-YA has heard your requests and this coming week, they are bringing the Feast to the East!  Valid at Suki-Ya Tampines Mall only. Offer is valid with a minimum purchase of a free-flow drink per diner. Offer is valid only for buffet, but not valid with additional add-ons or a la carte drinks (e.g. beer, sake, water). Dinner is priced at S$24.90++ per pair. This “House of Hot Pot” is designed to offer heart-warming dining experiences at equally affordable prices. Diners enjoy unlimited, top-quality chilled beef and pork in paper-thin slices and farmed chicken that are oh-so-delicious in their own right. Another highlight of Suki-Ya is its vegetable bar featuring a wide variety of fresh vegetables to round up the meal with a healthy touch. Along with sumptuous soups and broths, dining at Suki-Ya is bound to perk up everyone’s taste buds! (Photos below for illustration purpose)     Check out the 2020 menu and pricing below   Terms &amp; conditions Valid at Suki-Ya Tampines Mall only. Offer is valid with a minimum purchase of a free-flow drink per diner. Offer is valid only for buffet, but not valid with additional add-ons or a la carte drinks (e.g. beer, sake, water). Dinner is priced at S$24.90++ per pair. Offer is limited to 60 minutes dining period, a maximum of two redemptions (four pax) per bill/table. No splitting of bill/table allowed. Only walk-ins are accepted. Valid for dine-in only; no takeaways. Outlet details TAMPINES MALL 4 Tampines Central 5 #B1-02, Tampines Mall Singapore 529510 Tel: 6789 6166 OPENING HOURS: Sunday to Thursday: 11:30am – 9:00pmFriday – Saturday* : 11:30am – 9:00pm*incl. Eves of &amp; Public Holidays  Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Subway: 1-for-1 sub at Kallang Wave Mall outlet on 5 March 2020\t", "start": "2020-03-05T00:00:00+08:00", "end": "2020-03-05T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/10/Subway-feat-25-Oct-2019-300x157.jpg", "vendor": "Kallang Wave", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! One Day Only: Buy One, Get One FREE! March on down to the Subway restaurant at Kallang Wave Mall this Thursday for this exclusive promo Bring your friends and family, and enjoy your favourite subs! Talk about the perfect mid-week deal Promotion valid with purchase of a drink  Only available at Kallang Wave outlet on 5 March 2020. Buy one 6″ sub and get another free 6″ sub with the purchase of a drink. Free sub will be the lower price of the two subs. Visuals are for illustration purposes only. SUBWAY® is a Registered Trademark of Subway IP Inc. © 2019 Subway IP Inc. Outlet Details Kallang Wave #01-55  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " The Clifford Pier (The Fullerton Bay Hotel Singapore): 1-for-1 dinner buffet with DBS/POSB cards (3 Mar – 27 May)\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/The-Clifford-Pier-2-1-Mar-2020-300x157.jpg", "terms": "1-for-1 dinner buffet @ The Clifford Pier (The Fullerton Bay Hotel Singapore) Occupying the space of the original Clifford Pier, The Clifford Pier preserves the pier’s hawker culture while honouring its historical role as the landing point of Singapore’s forefathers. The menu showcases the rich diversity of Singapore’s culinary culture, featuring Malay and Peranakan dishes alongside Chinese favourites and Western staples. 1-for-1 dinner buffet with DBS/POSB cards! Valid for dinner buffet on Tuesdays and Wednesdays only. Promotion Period: 03/03/2020 to 27/05/2020 Main Outlet: The Fullerton Bay Hotel Singapore, 80 Collyer Quay, Singapore 049326 Dinner Monday to Friday, 6.30 p.m. to 10.00 p.m. To make a reservation, please visit here.   Terms and Condition: Valid for dinner buffet on Tuesdays and Wednesdays only. Limited to the first 100 adults per meal time. Prior reservations are required and must be made online through The Fullerton Bay Hotel Singapore’s website. Please select ‘DBS 1-for-1 Heritage Buffet’ under the Promotion dropdown menu and tick the relevant offer box while placing your reservation. Valid for a maximum of 8 persons per card per reservation. Reservations made through third-party platforms are not eligible for the offer. Table seating is subject to the restaurant’s availability. DBS General Promotion Terms &amp; Conditions apply, visit www.dbs.com.sg/dbscardstnc. For more info on the restaurant, click here. Make your reservations online here. Please select a date that falls on Tuesday/Wednesday (3 Mar – 27 May) and select ‘DBS 1-for-1 Heritage Dinner Buffet’ under the Promotion dropdown menu and tick the relevant offer box while placing your reservation. Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Fast Food, Restaurants, Dining, Groceries "},
{"name": " Morganfield’s: 1-for-1 Baby Back Ribs (2 – 15 March 2020, Sun – Thurs)\t", "start": "2020-03-02T00:00:00+08:00", "end": "2020-03-15T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Morganfields-feat-2-Mar-2020-300x157.jpg", "vendor": "Morganfield&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Sunshine and happy times. Let’s make it a point to enjoy the little things in life! Come on down to Morganfield’s and let them treat you to a FREE full slab of Baby Back Ribs with every Baby Back Ribs ordered! So grab your Baby Back loving buddy and make your reservation now. Simply quote BBRMAR in the comments when you book. Make your reservations now and have a good time with your loved ones at Morganfield’s, Home of the Best Ribs in Town  Terms &amp; Conditions: Applicable from Sunday – Thursday, 5pm onwards. Promotion applicable from 2 March – 15 March 2020. Applicable for dine-in only. Available at all Morganfield’s outlets. Not applicable with other promotions or discounts. Reservation is required. Quote BBRMAR in the comment section when making your reservations to enjoy the discount. The management reserves the right to change the terms &amp; conditions without prior notice. Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Gong Cha: 1-for-1 Brown Sugar Fresh Milk with Pearl / Brown Sugar Fresh Milk Tea with Pearl at Takashimaya (Weekdays, 2 – 13 Mar ’20)\t", "start": "2020-03-02T00:00:00+08:00", "end": "2020-03-13T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/10/Gong-Cha-feat-21-Oct-2019-300x157.jpg", "vendor": "Ngee Ann City", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! One for you and another to share!  Buy 1 get 1 FREE for Brown Sugar Fresh Milk with Pearl / Brown Sugar Fresh Milk Tea with Pearl at Gong Cha Takashimaya, B2 Valid only on weekdays from Mon 2 Mar to Fri 6 Mar 2020 and Mon 9 Mar to Fri 13 Mar 2020, 12pm to 6pm daily! While stocks last. Terms and conditions apply. #takashimayasg  Outlet details Takashimaya (TAKA) 391A Orchard Road #B2 08-7, Takashimaya Department Store, Singapore 238873  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " DBS/POSB cardholders enjoy 1-for-1 lunch/dinner buffet at Town Restaurant (The Fullerton Hotel Singapore) till 30 April ’20 (Mon/Thu only)\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Town-Restaurant-3-Feb-2020-300x157.jpg", "terms": "With its classic interiors and seats finished in leather, Town Restaurant is the perfect spot for a power breakfast, casual business lunch or pre-theatre dinner at The Fullerton Hotel Singapore. Town Restaurant offers delicious international flavours in an extensive à la carte menu alongside themed buffets. Come sundown, book your after-work drinks at the al fresco waterfront terrace, which places you right next to the historic Singapore River. Enjoy 1-for-1 lunch buffet and 1-for-1 dinner buffet at Town Restaurant (The Fullerton Hotel Singapore) with DBS/POSB cards Prior reservations are required and must be made online through The Fullerton Hotel Singapore’s website. Please select ‘DBS 1-for-1 Lunch’ or ‘DBS 1-for-1 Dinner’ under the Promotion dropdown menu and tick the relevant offer box while placing your reservation. Promotion Period: 03/03/2020 to 30/04/2020 Main Outlet: The Fullerton Hotel Singapore, 1 Fullerton Square, Singapore 049178 International Lunch Monday to Friday, 12.00 p.m. to 2.30 p.m. S$59* per adult; S$29* per child^ Brimming Dinner Daily, 6.30 p.m. to 10.30 p.m. Sunday to Thursday: S$59* per adult; S$30* per child^ Friday and Saturday S$87* per adult; S$44* per child^ Add S$10 nett for a glass of house beer, wine or Singapore Sling Terms and Conditions: For more info on the restaurant, click here. Make your reservations online here. Please select a date that falls on Monday/Thursday (till 30 April ’20) and selected ‘DBS 1-for-1 Lunch’ or ‘DBS 1-for-1 Dinner’ under the Promotion dropdown menu and tick the relevant offer box while placing your reservation. Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Fast Food, Restaurants, Dining, Groceries "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " McDonald’s will be offering 1-for-1 Mocha or Caramel Frappe® from 28 Feb – 1 Mar 2020\t", "start": "2020-02-28T00:00:00+08:00", "end": "2020-03-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Mocha-or-Caramel-Frappe-300x158.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Mocha or Caramel Frappe® via McDonald’s App This deal is only valid from 28 Feb – 1 Mar 2020 (Fri – Sun) 12pm – 4am, while stocks last. Limited to one redemption per transaction.  Mocha Chip Frappé (left). A balanced blend of rich, roasted coffee, dark chocolate and a hint of vanilla – all topped with whipped cream, chocolate powder and chocolate drizzle Caramel Frappé (right), A blend of rich, dark roast coffee balanced with buttery caramel and a hint of vanilla; topped with whipped cream and caramel drizzle. Sweet dreams are made of these! Note: Deal may not be available at all outlets, check app for detailed info Deal is valid from 21 Feb -1 March 2020, from 12 noon – 4am, Friday, Saturday, and Sunday only, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. This deal may not be used in conjunction with any other promotions or discounts. Valid at all stores in Singapore except LIDO, institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again, until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg/ allergens-listing Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.   For more info, click here. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " GODIVA outlets will be offering 1-for-1 Chocolate Twist Soft Serve this weekend (28 Feb – 1 Mar 2020)\t", "start": "2020-02-28T00:00:00+08:00", "end": "2020-03-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Godiva-feat-26-Feb-2020-300x158.jpg", "vendor": "Godiva", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Chocolate Twist Soft Serve Bringing back the all-time favourite deal for you! Godiva’s Chocolate Twist Soft Serve is 1-for-1 only for this weekend! Promotion Period: 28 Feb – 1 Mar Terms and Conditions: Not Valid with VIP Privileges &amp; other promotions While stocks last Picture is for reference only In case of disputes, the decision of Godiva Chocolatier (Asia) Limited shall be final and binding Usual prices Soft Serve = $9 100gm Truffles = $34 100gm Pralines = $28    Find your nearest outlet here (Bugis Junction, ION, Raffles City, Suntec City, Takashimaya) Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s will be offering 1-for-1 Big Breakfast® from 2 – 4 March 2020\t", "start": "2020-03-02T00:00:00+08:00", "end": "2020-03-04T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/Big-Breakfast-feat-20-Sep-2019-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Big Breakfast via McDonald’s App This deal is only valid from 2 – 4 March 2020, 4am – 11am, while stocks last. Limited to one redemption per day. Big Breakfast®. Freshly scrambled eggs set aside a sizzling sausage, perfectly crisp Hashbrowns and mouth-watering toasted muffins. What more could anyone ask for? Note: Deal may not be available at all outlets, check app for detailed info  Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.   For more info, click here. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " SUKI-YA: 1-for-1 buffet with unlimited servings of fresh meat, fresh vegetables, pot dishes & dessert at Plaza Singapura (24 Feb – 1 Mar ’20)\t", "start": "2020-02-24T00:00:00+08:00", "end": "2020-03-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/SUKIYA-feat-23-Feb-2020-300x157.jpg", "vendor": "Plaza Singapura", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Because it takes two to Shabu-Shabu! This week, enjoy 1-for-1 buffet at Plaza Singapura with unlimited servings of fresh meat, fresh vegetables, pot dishes and dessert. Yum! Valid at Suki-Ya Plaza Singapura only. Offer is valid with a minimum purchase of a free-flow drink per diner. Offer is valid only for buffet, but not valid with additional add-ons or a la carte drinks (e.g. beer, sake, water). Dinner is priced at S$24.90++ per pair from Monday to Thursday and S$27.90++ per pair on Friday to Sunday. Offer is limited to 60 minutes dining period, a maximum of two redemptions (four pax) per bill/table.  Check out the menu below   Terms &amp; conditions Valid at Suki-Ya Plaza Singapura only. Offer is valid with a minimum purchase of a free-flow drink per diner. Offer is valid only for buffet, but not valid with additional add-ons or a la carte drinks (e.g. beer, sake, water). Dinner is priced at S$24.90++ per pair from Monday to Thursday and S$27.90++ per pair on Friday to Sunday. Offer is limited to 60 minutes dining period, a maximum of two redemptions (four pax) per bill/table. No splitting of bill/table allowed. Only walk-ins are accepted. Valid for dine-in only; no takeaways. Outlet Info Plaza Singapura 68 Orchard Road #04-62 Plaza Singapura Singapore 238839 Tel: 6835 9406 OPENING HOURS: Monday – Thursday: 11:30am – 9:00pmFriday – Sunday*: 11:30am – 9:00pm*incl. Eves of &amp; Public Holidays  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Häagen-Dazs is having another 1-for-1 Parfait deal from 24 – 28 February 2020\t", "start": "2020-02-24T00:00:00+08:00", "end": "2020-02-28T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/HagenDazs-feat-13-Feb-2020-300x160.jpg", "vendor": "Häagen-Dazs", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Crunch your way to an extraordinary week ahead with the Häagen-Dazs Parfait promotion From 24 – 28 Feb, enjoy a 1-for-1 parfait deal and treat your loved ones. Choice of flavour: Fruit &amp; Granola, Caramel &amp; Nuts, and Cookies &amp; Fudge #HDAndMe #HaagenDazsSG #EverydayMadeExtraordinary #LoveLikeNothingElse #Parfait  Terms and conditions This promotion is only valid for takeaways and there are additional charges for toppings. Also, not to be used in conjunction with other promotional programs, vouchers, offers and VIP privileges. Find your nearest outlet at the official website here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Krispy Kreme will be offering a Buy-6-Get-6-Free Original Glazed doughnuts deal on 24 February 2020\t", "start": "2020-02-24T00:00:00+08:00", "end": "2020-02-24T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Krispy-Kreme-feat-22-Feb-2020-300x158.jpg", "vendor": "Krispy Kreme", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! In with the old, and out with the new! This time ’round, Krispy Kreme is spreading #happiness and #joy through their doughnuts by offering a Buy 6 Get 6 Original Glazed for FREE! Buy 6 to get 6 FREE Original Glazed doughnuts for only $15.60 (U.P. $31.20). Price may vary. T&amp;Cs apply. While stocks last. Max purchase of 2 dozens per person. Turn on your notifications and mark your calendars – this coming Monday, 24 February at 12:30PM and 4pm. You won’t want to miss this! Participating Outlets: Changi Airport Terminal 2, #026-015-01/B Compass One, #01-46B Jurong Point 2, #01-31 Paragon, #B1-K6 Suntec City, #01-419/420 North Wing Timeslots Timeslot 1: 12.30PM to While Stocks Last Timeslot 2: 4PM to While Stocks Last #KrispyKreme #KrispyKremeSG #NoMondayBlues #OriginalGlazed #buy6free6 #6for6  Find your nearest outlet here (note: available only at above-mentioned outlets) Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Suki-Ya Kin at Vivocity is offering 1-for-1 Shabu Shabu all-day (26 – 27 Feb ’20)\t", "start": "2020-02-26T00:00:00+08:00", "end": "2020-02-27T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/SukiYa-feat-25-Feb-2020-300x153.jpg", "vendor": "Vivocity", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Suki-Ya Kin – 1-for-1 Shabu Shabu (Vivocity) Dig into a sumptuous spread of premium ingredients from Angus Beef, Wagyu Beef, and Seafood *Price and ingredient will vary according to menu chosen Valid for 60mins only. Valid on 26 &amp; 27 February, all day, only at VivoCity. Check out the menu below (Note: It is dated as of Sept 2018 and may have changed)   Terms &amp; conditions Only walk-ins accepted. Valid for 60mins only. Not valid on Public Holidays, Special Occasions (i.e. Halloween) and their respective eves. Limited to 2 redemptions (maximum 4 pax, 2 pax complimentary only) per table, per card, per bill, per party and per occasion. Diners from the same party are not allowed to split bills and/or tables Not valid at other Suki-Ya outlets except Suki-Ya KIN, VivoCity. Diners at the same table must opt for the same buffet package. Valid for buffet only. Not valid for any additional top-ups or a la carte drinks. Item of equal or lower value will be discounted. Offers are applicable to the billed amount before prevailing GST and Service Charge. Valid for dine-in only, not applicable for private events, take-away or bookings of more than 15pax. Not valid with any other promotions, vouchers, discounts, offers, dining apps and any credit/debit card privileges. Management reserves the right to amend any dishes, prices and terms and conditions without prior notice. Venue VIVOCITY – SUKI-YA KIN (金) 1 Harbourfront Walk #01-102/103 Singapore 098585 Tel: 6377 0070 OPENING HOURS: Monday – Friday: 12pm – 10pm Saturday, Sunday &amp; P.H.: 11.30am – 10pm  Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Fairprice: Ben & Jerry’s ice cream pints including the new “Chip Happens” flavour are going at 2-for-$19.90 (U.P. $27.80) till 25 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Fairprice-Ben-feat-19-Mar-2020-300x157.jpg", "terms": "Stock up on Ben &amp; Jerry’s ice cream with NTUC Fairprice’s latest weekly promotion. The new “Chip Happens” Netflix flavour is described as “a cold mess of chocolate ice cream with fudge chips and crunchy potato chip swirls”. Grab two tubs of Ben &amp; Jerry’s assorted for $19.90 (usual $27.80) That’s about $9.95 per tub. Limited to 6 units per purchase The promotion is also available at Fairprice’s Online store at www.fairprice.com.sg. *Not all products listed are available on FairPrice On. Click on image to enlarge  Find your nearest Fairprice outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Emirates: 7% – 13% off fares promo code for UOB cardholders valid till 31 December 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/06/Emirates-4-Jun-2016-300x161.jpg", "terms": "Save on Emirates flights with UOB cards. UOB cardholders enjoy Up to 13% off flights (SIN-MEL)13% off Flex Fares for Business and Economy Class Cabins10% off Saver Fares for Business and Economy Class Cabins Up to 11% all other destinations11% off Flex Fares for Business and Economy Class Cabins7% off Saver Fares for Business and Economy Class Cabins Booking period: 1 Jan to 31 Dec 2020 Travel period: 1 Jan 2020 to 31 Mar 2021 Use code SGUOB01 when booking to enjoy Head over to www.emirates.com/sg/uob to book today! T&amp;Cs apply. For more info, click here Book your hotels online at much less than over-the-counter rates. Popular online hotel booking services include Hotels.com www.Hotels.com, Expedia www.expedia.com.sg and Agoda www.agoda.com Share this with your friends &amp; family members on Facebook! For more information on Emirates, visit www.emirates.com/sg.  ", "category": "Airlines, Flights, Air Fares, Seats, Tickets Events "},
{"name": " LiHO is offering 1-for-1 ALL drinks on weekdays at 18 selected outlets (From 25 Feb ’20) ", "start": "2020-02-25T00:00:00+08:00", "end": "2020-03-20T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/LiHO-feat-25-Feb-2020-300x158.jpg", "vendor": "LiHO", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1 for 1 ALL drinks from today. Valid as of 9 March 2020  UPDATE 2 March: 3 more outlets added UPDATE 20 March: Ends on 20 March Buy one get one free all drinks at selected outlets on weekdays, 2pm – 6pm. Valid from 25 Feb 2020 for a unspecified time Available at  Terms &amp; conditions Customers will be able to redeem 1 free drink with the purchase of any drink Second cup of drink must be the same, and same size Toppings are not included in the BUY ONE, FREE ONE Promotion. Not valid with other promotions, discounts and corporate privileges Promotion is not valid for use with other LiHO TEA vouchers and/or RTG vouchers Valid for redemption at selected outlets, not for delivery Find your nearest LiHO outlet here (Note: only available at above listed outlets) Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Jack’s Place is offering 1-For-1 Main Course during Happy Hour on weekdays till 29 April 2020 ", "start": "2020-01-02T00:00:00+08:00", "end": "2020-04-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Jacks-Place-feat-18-Feb-2020-300x157.jpg", "vendor": "Jack&#39;s Place", "terms": "Take a break and enjoy Happy Hour with your loved ones, friends or colleagues! UPDATE: Extended till 31 March UPDATE#2: Extended till 29 April 2020 Enjoy 1-For-1 Main Course* when you dine-in on weekdays from 2.30pm to 5.30pm. So, what are you waiting for? You don’t wanna miss this! *13 main course to choose from. T&amp;Cs apply. Make your reservation here  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s will be offering 1-for-1 Filet-O-Fish® from 24 – 27 February 2020\t", "start": "2020-02-24T00:00:00+08:00", "end": "2020-02-27T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/McDonalds-filet-18-Dec-2019-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Filet-O-Fish® via McDonald’s App This deal is only valid from 24 – 27 Feb 2020, while stocks last. Filet-O-Fish®. The catch of the day is sure a great catch at McDonald’s. A fish filet, smothered with tangy tartar sauce and half a slice of cheese between tender steamed buns is simply pure ocean heaven. Note: Deal may not be available at all outlets, check app for detailed info  Note: Deal may not be available at all outlets, check app for detailed info Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.   For more info, click here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Famous Amos is offering 1-for-1 260g Cookies in Bag for all flavours till Sunday, 23 February 2020\t", "start": "2020-02-21T00:00:00+08:00", "end": "2020-02-23T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Famous-Amos-feat-21-Feb-2020-300x158.jpg", "vendor": "Famous Amos", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1 for 1 cookies for all flavours up for grabs! 2 x 260g Cookies in Bag at $15.90. 3 days only from 21 – 23 Feb, today until Sun. Up to 50 redemptions per day, per outlet, so hurry and head down to any Famous Amos Fresh Bake Studio now to bag yourself this sweet deal!  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Delifrance has a 1-FOR-1 French Butter Croissant deal on Qoo10 (From 17 March 2020)\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Delifrance-feat-17-Mar-2020-300x157.jpg", "terms": "1 FOR 1 Butter Croissant. Baked freshly using the finest French butter, flour, and the authentic French style baking process, they have a uniquely French aroma that cannot be matched by others. Terms &amp; Conditions: Valid till 30 Apr 2020. Redemption at Delifrance Outlets. Check in-store on availability. Q-Price: S$6.40 Time Sale Price: S$2.90   For more info and to buy, visit the deal page at www.qoo10.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Tiger Sugar: 1-for-1 all desserts at Capitol Singapore from 21 – 23 February 2020\t", "start": "2020-02-21T00:00:00+08:00", "end": "2020-02-23T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Tiger-Sugar-feat-21-Feb-2020-300x156.jpg", "vendor": "Capitol Singapore", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Calling out all Tigerians, here’s an awesome deal for you! From 21/2/20 , FRIDAY – 23/2/20, SUNDAY ONLY , Buy 1 Get 1 Free for all Tiger Sugar Desserts !⁣ Follow both Tiger Sugar Singapore 新加坡老虎堂 and tiger sugar dessert to redeem deal! ⁣  Terms &amp; conditions Location Capitol Singapore #B2-23 [near City Hall Exit D]  Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Pizza Hut is offering 1-for-1 dine-in deals on selected pizzas, pastas, baked pasta & more till 29 February 2020\t", "start": "2020-02-18T00:00:00+08:00", "end": "2020-02-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Pizza-Hut-feat-21-Feb-2020-300x154.jpg", "vendor": "Pizza Hut", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! What’s better than a sweet deal for one? A delicious deal for two of course! Introducing, for a limited time only, Pizza Hut’s 1-for-1 dine-in deal*. Because good deals come in pairs! Hurry, grab your makan buddy and head down today. Available from 3pm to 10pm on weekdays and 11am to 10pm on weekends. This promo is available for selected items only. The items are as follows: Reg Pan Pizzas : Hawaiian Supreme, BBQ Chicken, Veggie Lover, Margherita, Pepperoni, Super Supreme Pasta : Turkey Bacon Aglio Olio, Prawn Aglio Olio, Spicy Seafood Parchment Baked Pasta / Rice : Chicken Royale Baked Pasta, Curry Zazzle Baked Rice Entree : Fish ‘N’ Chips  Terms &amp; conditions Valid for dine-in at selected pizza hut restaurants only Valid only for selected mains Valid on weekdays 3pm – 10pm, weekends 11am – 10pm 1F1 not applicable if it coincides with special promotions, i.e: Unlimited Pizza Thursday Pizza Hut management reserves the right to amend the terms and conditions without prior notice Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " SUKI-YA: 1-for-1 Shabu Shabu dinner at Bugis+ from 17 – 23 February 2020\t", "start": "2020-02-17T00:00:00+08:00", "end": "2020-02-23T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/04/SUKIYA-3-faet-15-Apr-2019-300x154.jpg", "vendor": "Bugis+", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Say “Y E S” to Suki-Ya’s 1-FOR-1 ALL YOU CAN EAT SHABU SHABU DINNER Happening 17 – 23 February 2020 at Suki-Ya Bugis+, #04-14/15! Clock is ticking so hurry and call a pal down and feast! This “House of Hot Pot” is designed to offer heart-warming dining experiences at equally affordable prices. Diners enjoy unlimited, top-quality chilled beef and pork in paper-thin slices and farmed chicken that are oh-so-delicious in their own right. Another highlight of Suki-Ya is its vegetable bar featuring a wide variety of fresh vegetables to round up the meal with a healthy touch. Along with sumptuous soups and broths, dining at Suki-Ya is bound to perk up everyone’s taste buds!     Check out the 2020 menu and pricing below   Terms &amp; conditions  Valid at Bugis+ only. Offer is valid with a minimum purchase of a free-flow drink per diner. Offer is valid only for buffet, but not valid with additional add-ons or a la carte drinks (e.g. beer, sake, water). Dinner is priced at S$24.90++ per pair from Monday to Thursday and S$27.90++ per pair on Friday to Sunday. Offer is limited to 60 minutes dining period, a maximum of two redemptions (four pax) per bill/table. No splitting of bill/table allowed. Only walk-ins are accepted. Valid for dine-in only; no takeaways. Outlet details BUGIS + #04-14/15 201 Victoria Street Singapore 188067 Tel: 6884 5778  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s will be offering 1-for-1 Mocha or Caramel Frappe® from 21 – 23 Feb 2020 ", "start": "2020-02-21T00:00:00+08:00", "end": "2020-02-23T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Mocha-or-Caramel-Frappe-300x158.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Mocha or Caramel Frappe® via McDonald’s App This deal is only valid from 21 Feb – 1 March 2020 (Fri – Sun) 12pm – 4am, while stocks last. Limited to one redemption per transaction.  Mocha Chip Frappé (left). A balanced blend of rich, roasted coffee, dark chocolate and a hint of vanilla – all topped with whipped cream, chocolate powder and chocolate drizzle Caramel Frappé (right), A blend of rich, dark roast coffee balanced with buttery caramel and a hint of vanilla; topped with whipped cream and caramel drizzle. Sweet dreams are made of these! Note: Deal may not be available at all outlets, check app for detailed info Deal is valid from 21 Feb -1 March 2020, from 12 noon – 4am, Friday, Saturday, and Sunday only, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. This deal may not be used in conjunction with any other promotions or discounts. Valid at all stores in Singapore except LIDO, institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again, until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg/ allergens-listing Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.   For more info, click here. Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Pho Street is running a 1-for-1 promotion on selected sets at most outlets (till 1 March 2020)\t", "start": "2020-02-18T00:00:00+08:00", "end": "2020-03-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Pho-Street-feat-18-Feb-2020-300x158.jpg", "vendor": "Pho Street", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Hearty meals are meant to enjoyed together. From 18 Feb to 1 March, enjoy a 1-for-1 set deal when you order selected sets at Pho Street ! Available at all Pho Street outlets except T2, T4 and Gardens By the Bay.  Terms and conditions Available at all Pho Street outlets except T2, T4 and Gardens By the Bay. Promotion is valid from 18 February to 1 March 2020. Only applicable to Pho Beef Tender Slices set, Dry Rice Vermicelli with Grilled Pork Belly set and Lemongrass Chicken with Rice set. The free set item will be the same as the set ordered. Strictly no change of set items are allowed. Only one redemption per transaction. Customer(s) must flash the promotion before the order is placed to enjoy the promotion. Not valid in conjunction with other promotions, discounts, vouchers, gift cards. Available for Dine in and Takeaways only. Prices are subjected to service charge and prevailing GST. Prices may vary at Pho Street Galaxis and Hong Leong Building. Pho Street Restaurant Pte Ltd reserves the right to amend any terms and conditions without prior notice. For outlet locations, visit www.phostreet.com.sg Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Hong Kong Sheng Kee Dessert is offering 1-For-1 Selected Sets from $10.50 (U.P. $25) till 1 March 2020\t", "start": "2020-02-18T00:00:00+08:00", "end": "2020-03-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Hong-Kong-Sheng-feat-18-Feb-2020-300x156.jpg", "vendor": "Hong Kong Sheng Kee Dessert", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed!  Flash &amp; Redeem 1-For-1 Selected Sets! Available at all Hong Kong Sheng Kee Dessert Outlets (except T2), 19 Feb – 01 Mar 2020, simply flash this coupon to enjoy 1-For-1 Selected Sets from $10.50 (U.P.$25)! Choose from HK Char Siew Noodle, Seafood Noodle with Dried Prawn Roe, Pork Chop Noodle, Chicken Chop Noodle, Pork Chop Rice, Shrimp Paste Pork Belly Rice, Beef Brisket Rice, Black Pepper Beef Rice (All sets come with a serving of HK Carrot Cake and Iced Milk Tea)  Terms &amp; Conditions apply Customer needs to flash the post to enjoy the offer. Free set will be based on the lower priced set. No change of set items is allowed. Valid at all Hong Kong Sheng Kee Dessert outlets except Changi Airport T2. Valid all day on weekdays and weekend. Valid for dine-in and takeaway. Valid till 1 March 2020. Price is subject to service charge and GST. Offer is only valid upon ordering at the counter. Not valid in conjunction with other discounts, privileges and promotions. While stocks last. Hong Kong Sheng Kee Dessert reserves the right to change the terms and conditions without prior notice. Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Delifrance to offer 1-for-1 Classic Mayo Sandwich from 18 – 21 Feb 2020 ", "start": "2020-02-18T00:00:00+08:00", "end": "2020-02-21T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Delifrance-feat-15-Feb-2020-300x157.jpg", "vendor": "Delifrance", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! FEBulous deals just for you! UPDAATE 20 Feb: Due to overwhelming response, this promotion will only be valid from 12:00-3:00pm tomorrow (21Feb).*While stock last. 18-21 Feb: 1-for-1 Classic Mayo Sandwich Choose from Flavours: Egg D’vine, Chicken D’light, Tuna D’licious or Seafood D’sire Valid from 12pm – 9pm. Upcoming Deal: 25-28 Feb – 2nd cup Freshly Brewed Coffee at $1.00  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Agoda: Citi Cardmembers enjoy additional 7% off worldwide accommodation! Book by 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/08/Agoda-Logo-17-Aug-2016-300x148.jpg", "terms": "Enjoy great savings at Agoda.com with Citibank cards at www.agoda.com/citibanksg.  Additional 7% off worldwide accommodation for Citi Cardmembers! Book now at www.agoda.com/citibanksg Not a Citibank cardmember? Apply for a Citibank card for a limited time &amp; get free sign-up gifts! Visit www.citibank.com.sg for more info. Terms &amp; Conditions For more info, visit www.agoda.com/citibanksg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events Vacations, Travel Deals, Cruises, Luggage Bags, Equipment, Hotels "},
{"name": " Book Depository: 5% OFF storewide coupon code for Mastercard cardholders valid till 14 August 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2017/09/Book-Depository-14-Sep-2017-300x158.jpg", "terms": "Get an extra 5% off already great prices to help you find your new favourite book at The Book Depository www.bookdepository.com/mastercard when you enter the coupon code below The Book Depository – www.bookdepository.com/mastercard – specialises in having one of the largest ranges of books on Earth backed up by free delivery to over 100 countries (including Singapore). The selection features a broad range of books  Using your discount voucher, exclusively available for the Mastercard Overseas Student Education Program, you’ll receive an extra 5% off on already low prices. Terms and Conditions Other terms and conditions apply. function showCouponLink(eg){window.open(eg.href);jQuery('.couponCode').show('slow');jQuery('.couponCode').css('font-size','1.5em');jQuery('.couponCode').css('font-weight','bold');} Visit The Book Depository and reveal the coupon code below Enter this coupon code in the basket (Click box above to reveal):  (Coupon Code 1)  Visit www.bookdepository.com/mastercard for more info Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Books, Magazines, Graphic Novels, Stationery Events "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Agoda: StanChart cards enjoy Up to 75% off + additional 7% off worldwide when you book by 30 Apr 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/08/Agoda-Logo-17-Aug-2016-300x148.jpg", "terms": "Book with Standard Chartered credit cards to enjoy savings at www.agoda.com/sc.  Up to 75% off + additional 7% off worldwide for Standard Chartered Cardmembers! Book now at www.agoda.com/sc. Terms &amp; Conditions For more info, visit www.agoda.com/sc. Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Credit Cards, Prepaid Cards, Banks Events Vacations, Travel Deals, Cruises, Luggage Bags, Equipment, Hotels "},
{"name": " Triple Three: 1-for-1 lunch buffet with DBS/POSB cards till 30 April 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/Triple-Three-2-Jan-2020-300x156.jpg", "terms": "Enjoy 1-for-1 Lunch Buffet at Triple Three Mandarin Orchard Singapore with DBS/POSB Cards UPDATE 5 March: End date has been changed from 31 Dec to 30 April 2020 Japanese-inspired Triple Three boasts an extensive international buffet selection daily, featuring fresh sashimi and sushi, seafood on ice, live cooking stations, a premium roast section and delectable desserts. On Sundays, laze the day away while sipping on sparkling wine and indulging in freshly shucked oysters, while the young ones are entertained at the Kids’ Corner. DBS/POSB cards enjoy 1 for 1 lunch! Two adults only need to pay the price for one adult Looking for dinner (6.30pm – 10.00pm) option? Enjoy 50% off for every second adult when payment is made using any DBS/POSB/UOB credit or debit card. Usual Lunch Buffet prices Monday-Saturday: $78++ per adult; $28++ per child (6-12 yrs) Sunday Family Lunch: $118++ (Adult), $48++ (Child 6 to 12 yrs) All prices are subject to 10% service charge and 7% GST. Lunch hours Monday to Saturday: 12.00pm – 2:30pm Sunday: 12.00pm – 3:00pm Dinner hours Daily: 6.30pm – 10.00pm Prices are subject to change on eve of and on public holidays, and during promotional periods. All prices are subject to 10% service charge and 7% GST. Terms and Conditions: Buffet items may vary. Not applicable on eve of and on PH. DBS General Promotion Terms &amp; Conditions apply, visit www.dbs.com.sg/dbscardstnc. To reserve via Chope, click here. Or call 6831 6271 / 6288 or email dine.orchard[at]meritushotels.com Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Mr Bean: 1-for-1 set of Hazelnut Pancake + Pearly Soy Milk deal from 15 February 2020 ", "start": "2020-02-15T00:00:00+08:00", "end": "2020-02-28T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Mr-Bean-29-Dec-2019-300x155.jpg", "vendor": "Qoo10", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Mr Bean [1 set for 1 set] – 1 Hazelnut Pancake + 1 Pearly Soy Milk FREE 1 Hazelnut Pancake + 1 Pearly Soy Milk $3.90 (U.P. $7.80) A total of 54 particpating outlets are open for this offer. Do note that certain outlets are excluded. Redemption from 4 Feb (11am) – 29 Feb 2020 Can be redeemed islandwide at 54 participating Mr Bean outlets (excluding schools, polyclinics &amp; hospitals) This deal must be pre-purchased online at www.qoo10.sg Price Retail Price: S$7.80 Q-Price: S$4.30 Sale Price: S$3.90  Terms &amp; Conditions Valid from 4 February to 29 February 2020, 11am – 8pm Can be redeemed islandwide at 54 participating Mr Bean outlets (excluding schools, polyclinics &amp; hospitals) Strictly NO extension or cancellation of vouchers once expired Redemption strictly via MOBILE app only. (No printed voucher is accepted) Mr Bean reserves all rights to reject any redemptions that do not adhere to the Terms &amp; Conditions. Fore more info and to buy, visit www.qoo10.sg Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Cornetto Black Hojicha is going at 1-for-1 at 7-Eleven outlets till Saturday, 15 February 2020\t", "start": "2020-02-13T00:00:00+08:00", "end": "2020-02-15T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/7-Eleven-feat-13-Feb-2020-300x156.jpg", "vendor": "7-Eleven", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Limited time only This Valentine’s Day, enjoy a BUY 1 GET 1 FREE promotion with the Cornetto Black Hojicha at just $2.60! Only from now till 15 Feb, grab a couple of cones home and enjoy this moment of⁣ happiness with your loved ones The Cornetto Black Hojicha is a creamy Hojicha flavoured ice-cream in a crunchy black cone Get your hands on this Instagram-worthy ice cream  Find your nearest outlet here Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Big Fish Small Fish is offering 1-for-1 Classic Fish & Chips at JCube outlet till 29 February 2020\t", "start": "2020-02-13T00:00:00+08:00", "end": "2020-02-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Big-Fish-Small-feat-13-Feb-2020-300x158.jpg", "vendor": "JCube", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Have your fish in your way with Big Fish Small Fish’s New Menu Launch! Grab a friend and flash this e-coupon to enjoy a 1-for-1 Classic Fish &amp; Chips exclusive only at JCube from now till 29 Feb!  Terms &amp; Conditions Only Valid at Big Fish Small Fish JCube #03-07 Flash this e-coupon at cashier counter, limited to 1 redemption per e-coupon. Expires on 29 February 2020. Discount applied to the lowest a la main Classic Fish &amp; Chips. Venue JCube #03-07/08  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Häagen-Dazs will be offering 1-for-1 Parfait deal from 17 – 21 February 2020\t", "start": "2020-02-17T00:00:00+08:00", "end": "2020-02-21T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/HagenDazs-feat-13-Feb-2020-300x160.jpg", "vendor": "Häagen-Dazs", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Crunch your way to an extraordinary week ahead with the Häagen-Dazs Parfait promotion From 17 – 21 Feb, enjoy a 1-for-1 parfait deal and treat your loved ones. Choice of flavour: Fruit &amp; Granola, Caramel &amp; Nuts, and Cookies &amp; Fudge #HDAndMe #HaagenDazsSG #EverydayMadeExtraordinary #LoveLikeNothingElse #Parfait  Terms and conditions This promotion is only valid for takeaways and there are additional charges for toppings. Also, not to be used in conjunction with other promotional programs, vouchers, offers and VIP privileges. Find your nearest outlet at the official website here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Tuk Tuk Cha is offering 1-for-1 deal on their new Rose Tea series beverages (14 Feb 2020)\t", "start": "2020-02-14T00:00:00+08:00", "end": "2020-02-14T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Tuk-Tuk-Cha-feat-14-Feb-2020-300x157.jpg", "vendor": "Tuk Tuk Cha", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Show your love and appreciation for your partner, friends and families with Tuk Tuk Cha’s pretty in pink Blooming Rose Series that has hit Tuk Tuk Cha stores! Featuring the new Galaxy Rose Latte, which takes on an alluring pantone of blue and pink hues, layered with butterfly pea and rose milk. In addition, the all-time-favourite Thai Milk Tea and Thai Green Milk Tea has gotten a floral makeover to spread the love. Share the love, two is better than one! Enjoy 1-for-1 on the Rose Series Beverages! Available for ONE DAY ONLY on 14 February 2020, Friday, while stocks last. Simply LIKE their Facebook page and flash this post to the staff to enjoy the special offer. Be sure to date your valentine because Tuk Tuk moments are made for sharing! *Terms &amp; conditions apply.  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Yolé’s Valentine’s special edition Bandung Flavour is going at 1-for-1 on Thursday, 6 February 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Yol-feat-6-Feb-2020-300x155.jpg", "terms": "One for you, and one for me  Valentine’s special edition Bandung Flavour, now available. Taste the new flavour, enjoy 1-for-1 Large Bandung Cup, only for today! Promo available only for Large Bandung Cups for 6th February. Promo and flavour available at all stores except United Square and Westmall.  Find your nearest Yolé outlet here Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Fast Food, Restaurants, Dining, Groceries "},
{"name": " Citibank: Apply for selected credit cards & get free gifts such as $120 Cash Back, up to 37,300 Citi Miles & more! ", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/05/Citibank-Feat-31-May-2016-300x147.jpg", "terms": "There’s a Citi Card for your every need! Be rewarded as you spend.  Credit Cards offer varied benefits that cater to different types of financial and lifestyle needs. For that reason, compare credit card benefits before opting for one. Choosing the right credit card allows you to save more and also adds value to your lifestyle. Each Citi Credit Card offers specific rewards that complement diverse spending habits. Right from shopping, dining to travel, Citibank offers credit cards that reward all of kinds of spending. Compare credit cards effortlessly and make the right decision based on credit card features such as: Earning reward points Air miles &amp; travel privileges Earning cash back Savings on everyday expenses Features as of 17 Feb ’20:  Choose any of the following credit cards Citi PremierMiles Visa CardEarn up to 10 Citi Miles per S$1 spent on online travel bookingsEarn 2 Citi Miles with every S$1 overseas spendEarn 1.2 Citi miles with every s$1 local spend (no minimum spend requirement)Pay directly with miles for flights, hotels and moreNew Citi Cardmembers get up to 37,300 Citi Miles when you apply and spend*Apply now Citibank Rewards CardEnjoy 10X Rewards* for your online spend. *T&amp;Cs applyEnjoy 10X Rewards* for your shopping spend. *T&amp;Cs applyRedeem your points for absolutely anything through Citi ThankYou℠ Rewards.New Citi Cardmembers get up to 30,000 Citi ThankYou℠ Points when you apply and spend*Apply now Citi Lazada Card12X Reward Points* on Lazada spend (Valid till 29 February 2020).Earn 10X Reward Points (from 1 March 2020 onwards)5X Reward Points* on Dining, Travel, Entertainment and CommuteEnjoy shipping rebate* when you spend a min. of S$50 per transaction at Lazada, capped at 4 shipping rebates per monthNew Citi Cardmembers get S$150 Lazada vouchers &amp; 1-year LiveUp membership (worth S$59.90) as you spend*Apply now Citi Cash Back Card8% cash back on Dining, Groceries and Petrol daily, worldwide.Up to 20.88% fuel savings at Esso &amp; Shell.New Citi Cardmembers get S$120 cash back when you apply and spend*Apply now Citi Prestige CardEarn 5 Citi ThankYou℠ Points every S$1 spent overseas, and 3.25 Citi ThankYou Points (=1.3 Citi Miles) or every S$1 spent locallyIndulge in complimentary night hotel stay worldwide, airport transfers, 1-for-1 entertainment experiences and moreNew Citi Cardmembers receive 62,500 Citi ThankYou℠ Points (25,000 Miles) or Gadget Welcome GiftApply now Citibank SMRT Card5% savings# on groceries (7.3% for FairPrice Xtra Kallang Wave)5% savings# on fast food, movies and coffee3% savings# on online shoppingRedeem your SMRT$ for cash rebate instantly via SMSNew Citi Cardmembers get S$120 savings when you apply and spend*Apply now Exclusively for new to Citi Credit Cardmembers. * Terms &amp; conditions apply Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " LiHO has a 1-for-1 deal on selected Vitamin C packed drinks for two-days only (7 – 8 Feb 2020)\t", "start": "2020-02-07T00:00:00+08:00", "end": "2020-02-08T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/LiHO-feat-7-Feb-2020-300x157.jpg", "vendor": "LiHO", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Only valid for Boss Happy Deal fans!  LiHO is back with their 1 for 1 promo! You can enjoy the promo with these 3 drinks, Summer Passionfruit Green Tea, Strawberry Jing Syuan Tea and Golden Avocado Milk! From today to tomorrow. While stocks last! Join their telegram group here now to enjoy the deal! Simply flash this picture to the counter and show them that you’re in the group!  Terms and conditions Customers will be able to redeem 1 free drink with the purchase of any 1 of these vitamin c packed drinks Second cup of drinks must be the same Customer can only redeem 1 free drink in a single transaction Not valid with other promotions, discounts and corporate privileges Promotion is not valid for use with other LiHO TEA vouchers and/or RTG vouchers Valid for redemption at all outlets, not for delivery Promotion valid only today and tomorrow, 7-8 feb 2020, while stocks last! ENJOY! Find your nearest LiHO outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Starbucks: Enjoy 1-for-1 on Java Chip Frappuccino, Caramel Frappuccino and more when you pay with your Starbucks Card (11 to 14 Feb)\t", "start": "2020-02-11T00:00:00+08:00", "end": "2020-02-14T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Starbucks-8-Feb-2020-300x158.jpg", "vendor": "Starbucks", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Get one and enjoy another on the house Sip, sip, hooray! Your favourite 1-for-1 treat is coming Enjoy a 1-for-1 treat on Venti-sized Okinawa Brown Sugar Latte (hot, iced or blended), Black Sesame Pure Matcha Latte with Taro Foam (hot or iced), Blueberry Dark Mocha Frappuccino® (blended), Java Chip Frappuccino® (blended) and Caramel Frappuccino® (blended) from 11 to 14 Feb (Tue – Fri) Redeemable when you pay with your Starbucks Card. Valid from 11 to 14 Feb (Tue-Fri) on Venti-sized Okinawa Brown Sugar Latte (hot, iced or blended), Black Sesame Pure Matcha Latte with Taro Foam (hot or iced), Blueberry Dark Mocha Frappuccino® (blended), Java Chip Frappuccino® (blended) and Caramel Frappuccino® (blended) at all Starbucks Singapore stores (except for stores located at Changi Airport including Jewel). Limited to four vouchers per member, for a one-time use only. Java Chip Frappuccino® and Caramel Frappuccino® voucher is limited to the same drink redemption. Limited to 1 redemption per transaction. Offer is while stocks last. Offer is exclusive to your Starbucks account and is non-transferable. Not valid on Mobile Order &amp; Pay, delivery orders or with any other promotions or privileges. Other terms and conditions apply. Enjoy a tea-based treat or a coffee indulgence with these Japanese-inspired beverages.  The popular Okinawa Brown Sugar Latte is back! A hint of mellow sweetness from the Okinawa brown sugar elevates Starbucks signature espresso before being topped with fluffy whipped cream and brown sugar drizzle. Named after the sun-bathed Japanese island, Okinawa brown sugar is a premium ingredient famous for its deep and complex flavors. Available as a hot, blended or iced handcrafted beverage.  This fun, indulgent and colorful treat brings together Starbucks’ pure matcha with a velvety black sesame sauce, topped with a frothy layer of aromatic purple taro foam. The result is a perfect blend of distinctive flavor profiles – nutty, earthy and richly flavored. Available as a hot, blended or iced handcrafted beverage.  Meet the Pure Matcha Latte – a smooth, creamy and lightly sweetened beverage that’s made from premium microground matcha and served with steamed milk. Available hot and iced and you can opt to have yours unsweetened too. This season of love, Starbucks brings you the new Blueberry Dark Mocha Frappuccino®. A glorious combination of fruity blueberry, indulgent dark chocolate and rich coffee that’s topped with fluffy whipped cream, complete with blueberry drizzle.  Find your nearest Starbucks store here. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Ben & Jerry’s Singapore will be offering 1-for-1 Scoop Special this Valentine’s Day (14 Feb 2020)\t", "start": "2020-02-14T00:00:00+08:00", "end": "2020-02-14T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Ben-Jerrys-12-Feb-2020-300x158.jpg", "vendor": "313@Somerset", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Celebrate love and joy on the most romantic day of the year the only way you should – with your sweetheart, and your two favourite men, Ben and Jerry, who will make it a whole lot sweeter! On 14 February, Ben &amp; Jerry’s is doubling the romance as any two scoops of ice cream will be going at the price of one! Create the perfect combination of flavours together with your loved one and bask in the sugary sweet atmosphere filled with chunks &amp; swirls of euphoria!  Outlet Details 313@Somerset 313 Orchard Road, #01-25/25A Singapore, SG 238895 65096470  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " iTea is offering 1-for-1 drinks from 14 – 16 February 2020\t", "start": "2020-02-14T00:00:00+08:00", "end": "2020-02-16T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/iTea-feat-13-Feb-2020-300x158.jpg", "vendor": "iTea", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Enjoy 1-for-1 drinks when you claim a 1-for-1 voucher on the iTEA app.  How to get: Download the iTEA app for Google Play Store orApple App Store. #valentines  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " DBS/POSB cardholders enjoy 1-for-1 lunch/dinner buffet at Town Restaurant (The Fullerton Hotel Singapore) on Mondays till 27 April ’20\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Town-Restaurant-3-Feb-2020-300x157.jpg", "terms": "With its classic interiors and seats finished in leather, Town Restaurant is the perfect spot for a power breakfast, casual business lunch or pre-theatre dinner at The Fullerton Hotel Singapore. Town Restaurant offers delicious international flavours in an extensive à la carte menu alongside themed buffets. Come sundown, book your after-work drinks at the al fresco waterfront terrace, which places you right next to the historic Singapore River. Enjoy 1-for-1 lunch buffet and 1-for-1 dinner buffet at Town Restaurant (The Fullerton Hotel Singapore) with DBS/POSB cards Prior reservations are required and must be made online through The Fullerton Hotel Singapore’s website. Please select ‘DBS 1-for-1 Lunch’ or ‘DBS 1-for-1 Dinner’ under the Promotion dropdown menu and tick the relevant offer box while placing your reservation. Promotion Period: 03/02/2020 to 27/04/2020 Main Outlet: The Fullerton Hotel Singapore, 1 Fullerton Square, Singapore 049178 International Buffet Lunch Monday to Friday, 12.00 p.m. to 2.30 p.m. S$59* per adult; S$29* per child^ Brimming Buffet Dinner Daily, 6.30 p.m. to 10.30 p.m. Sunday to Thursday: S$59* per adult; S$30* per child^ Friday and Saturday S$85* per adult; S$43* per child^ Add S$10 nett for a glass of house beer, wine or Singapore Sling Terms and Conditions: For more info on the restaurant, click here. Make your reservations online here. Please select a date that falls on Monday (till 27 April ’20) and selected ‘DBS 1-for-1 Lunch’ or ‘DBS 1-for-1 Dinner’ under the Promotion dropdown menu and tick the relevant offer box while placing your reservation. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Fast Food, Restaurants, Dining, Groceries "},
{"name": " The Manhattan FISH MARKET is offering Buddy 1-for-1 deals from 5th – 10th Feb 2020 at all outlets\t", "start": "2020-02-05T00:00:00+08:00", "end": "2020-02-10T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/The-Manhattan-FISH-4-Feb-2020-300x160.jpg", "vendor": "Manhattan Fish Market", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Nothing is better than 1 for 1. Enjoy Buddy 1 for 1 from 5th – 10th Feb 2020 at all outlets. Product and presentation may vary due to the different concept at Causeway Point and Northpoint City. Dory’n Chips x Seafood Aglio Olio Dory’n Chips x Grilled Glory Dory Dory’n Chips x Baked Dory Valid at all outlets. Food presentation and items may vary for Northpoint and Causeway Point outlet due to different concept. No changing of items is allowed. All prices quoted are in Singapore Dollars and are subject to 7% GST. All pictures shown are for illustration purpose only. Actual product may vary due to product enhancement.   RELATED: The Manhattan FISH MARKET releases new coupon deals offering more than 40% discount (Valid till 29 February 2020) Find your nearest Manhattan FISH MARKET outlet here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " DBS/POSB cardholders enjoy Buy-1-Get-1-Free storewide at selected Hush Puppies Footwear stores (27 – 31 Jan)\t", "start": "2020-01-27T00:00:00+08:00", "end": "2020-01-31T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/DBSPOSB-22-Jan-2020-300x159.jpg", "vendor": "Hush Puppies Footwear", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Buy 1 Get 1 Free Shoes and Bags at selected Hush Puppies Footwear Retail Stores with DBS/POSB cards Store Locations: Changi City Point City Square Clementi Mall Compass One Great World City IMM JEM Jurong Point Square 2 Tampines Mall The Central The Star Vista Centrepoint Promotion Period: 27/01/2020 to 31/01/2020 Terms and Conditions: Offer is only available at selected Hush Puppies Footwear retail stores. Offer is available storewide and the lower-priced item would be complimentary. Offer is only valid for payment made using DBS/POSB Credit or Debit Cards. DBS General Promotion Terms &amp; Conditions apply, visit www.dbs.com.sg/dbscardstnc.  Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Footwear, Shoes, Slippers, Sneakers, Sandals "},
{"name": " Starbucks: From 4 – 7 Feb (Tue – Fri), enjoy 1-for-1 on selected beverages when you pay with your Starbucks Card\t", "start": "2020-02-04T00:00:00+08:00", "end": "2020-02-07T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/02/Starbucks-feat-1-Feb-2020-300x156.jpg", "vendor": "Starbucks", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Sip, sip, hooray! Your favourite 1-for-1 treat is coming  Enjoy a 1-for-1 treat on Venti-sized Okinawa Brown Sugar Latte, Black Sesame Pure Matcha Latte with Taro Foam and Blueberry Dark Mocha Frappuccino® from 4 – 7 Feb (Tue – Fri) Redeemable when you pay with your Starbucks Card. Valid from 4 to 7 Feb (Tue-Fri) on Venti-sized Okinawa Brown Sugar Latte (hot, iced or blended), Black Sesame Pure Matcha Latte with Taro Foam (hot or iced) and Blueberry Dark Mocha Frappuccino® (blended) at all Starbucks Singapore stores (except for stores located at Changi Airport including Jewel). Limited to four vouchers per member, each voucher limited to the same drink redemption, for a one-time use only. Limited to 1 redemption per transaction. Offer is while stocks last. Offer is exclusive to your Starbucks account and is non-transferable. Not valid on Mobile Order &amp; Pay, delivery orders or with any other promotions or privileges. Other terms and conditions apply. Enjoy a tea-based treat or a coffee indulgence with these Japanese-inspired beverages. The popular Okinawa Brown Sugar Latte is back! A hint of mellow sweetness from the Okinawa brown sugar elevates Starbucks signature espresso before being topped with fluffy whipped cream and brown sugar drizzle. Named after the sun-bathed Japanese island, Okinawa brown sugar is a premium ingredient famous for its deep and complex flavors. Available as a hot, blended or iced handcrafted beverage.  This fun, indulgent and colorful treat brings together Starbucks’ pure matcha with a velvety black sesame sauce, topped with a frothy layer of aromatic purple taro foam. The result is a perfect blend of distinctive flavor profiles – nutty, earthy and richly flavored. Available as a hot, blended or iced handcrafted beverage.  Meet the Pure Matcha Latte – a smooth, creamy and lightly sweetened beverage that’s made from premium microground matcha and served with steamed milk. Available hot and iced and you can opt to have yours unsweetened too. This season of love, Starbucks brings you the new Blueberry Dark Mocha Frappuccino®. A glorious combination of fruity blueberry, indulgent dark chocolate and rich coffee that’s topped with fluffy whipped cream, complete with blueberry drizzle.  Find your nearest Starbucks store here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Agoda: DBS/POSB Cardmembers enjoy up to 75% off + additional 7% off worldwide hotels till 31 Dec 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/08/Agoda-Logo-17-Aug-2016-300x148.jpg", "terms": "Enjoy great savings at Agoda.com with DBS/POSB cards at www.agoda.com/dbs.  Up to 75% off + additional 7% off worldwide for DBS and POSB Cardmembers Book now at www.agoda.com/dbs Terms &amp; Conditions For more info, visit www.agoda.com/dbs. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events Vacations, Travel Deals, Cruises, Luggage Bags, Equipment, Hotels "},
{"name": " Qoo10: Grab free $8 cart coupons (usable with min spend $60) valid till 24 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2017/02/Qoo10-28-Feb-2017-300x158.jpg", "terms": "Qoo10 is running a Cross The Hump promotion featuring free cart coupons worth  $8  at www.qoo10.sg till 24 March 2020  Event runs from 23 March 2020 00:00 Hours to 24 March 2020 23:59 Hours Coupons can only be received during the event period $8 Cart Coupon Coupon is applicable with a minimum purchase of $60 Coupon is limited to a total of 20,000 applicants daily Applicants can redeem once only General Event application/purchases are only available within Qoo 10 Singapore (www.qoo10.sg) Entries received after the event period will not be accepted All prizes cannot be exchanged for cash and are non-transferable Qoo10 Singapore reserves the rights to make any amendments to the contest period and mechanics at any point in time without prior notice By participating in the promotion events, you agree to be bound by the Terms and Conditions, the User Agreement and the decisions of Qoo10 Visit www.qoo10.sg for more info Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Department Stores, Online Stores, Online Major Sales Events Events "},
{"name": " Sheng Siong ONE-day deals on 20 Jan: Buy-1-Get-1-Free Pringles, Dove, Heaven & Earth, Dettol & More\t", "start": "2020-01-20T00:00:00+08:00", "end": "2020-01-20T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/Sheng-Siong-feat-20-Jan-2020-300x157.jpg", "vendor": "Sheng Siong", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Sheng Siong ushers in the year of the Rat with One Day Specials! This promotion is limited to TODAY ONLY, so get yours in time! Limited to 4 products per customer per transaction, unless otherwise stated! While stocks last! No traders allowed! Online shoppers will not get to enjoy these special offers! Some items listed are BUY 1 FREE 1GOLDEN DIAMOND Nyonya Kaya 410gFREZFRUTA Peanut Butter 340gPRINGLES Potato Crisps (Assorted Flavours) 147gDOVE Shower Gel (Assorted Variants) 1LHEAVEN &amp; EARTH / AUTHENTIC TEA HOUSE Tea (Assorted Flavours) 1.5LCHIPSMORE Mini Chocolate Chip Cookies (Original / Double Choco) 8 x 28gDETTOL Shower Gel (Assorted Variants) 950ml3M SCOTCH-BRITE Heavy Duty Scour Pads 3sGOLDEN FUJI Butane Fuel Cartridge Gas 3 x 250g Happy Family New Zealand Wild Abalone 425g UP: $45.80 Softess Premium Bathroom Tissue 100% Pure Virgin Pulp 3-ply x 200-sht x 10-roll x 3-pk FRIED FISHMAWS 100g UP: 2 For $9.90 SEARA Frozen Chicken Wingstick – Halal 1kg UP: $4.80 FREEZEPAK Crispy Chicken Nuggets – Halal 1kg UP: $9.25 IQF Mini Abalone (Pcs) UP: 10 For $20.00 Jean Fresh Frozen Rabbitfish (With Roe) 1kg UP: $8.99 CHINA Yong Chun Lukan 40pcs(XL) CHINA Premium Golden Pear 8-9s – Gift Pack (JUMBO) NEW ZEALAND Premium Cherry – Gift Pack 2kg USA Strawberry 454g CHINA Beijing Cabbage MALAYSIA Oyster Mushroom 150g and more Click on image to enlarge  Find your nearest Sheng Siong outlet here Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " SAFRA cardholders enjoy 1-for-1 Weekend Movie Tickets at all Shaw Theatres Box Offices (1 Feb – 29 Mar 2020) ", "start": "2020-02-01T00:00:00+08:00", "end": "2020-03-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/Shaw-Theatres-feat-2-31-Jan-2020-300x154.jpg", "vendor": "Shaw Theatres", "terms": "Present your SAFRA card at the Box Office to enjoy this promotion.  UPDATE 31 Jan 4pm from SAFRA: Please note that NRIC will not be required for the SAFRA 1-for-1 weekend ticket promotion at Shaw Theatres. Promotion is valid on Sat and Sun for the first 1,000 redemptions each day. Please note that subsequent tickets can be purchased at discounted prices of $11. Please note that SAFRA E-card will only be accepted at Shaw Theatres from 2020. Valid from 1 Feb – 29 Mar 2020 Promotion Details (SAFRA Members’ Exclusive) Pay $13.50 for one ticket and get the second ticket FREE *Valid on Sat and Sun and for the first 1,000 redemptions only.  1-for-1 movie tickets limited to first 1,000 redemptions per day. Valid from 1 Feb – 29 Mar 2020. Purchase a full-priced ticket at prevailing published public ticket price. Subsequent tickets can be purchased at prevailing SAFRA discount i.e. [ $11]. Applicable for purchase of tickets from Shaw Theatres box office only. Not applicable for tickets purchased through online, mobile and corporate bookings. Member must purchase ticket in person with valid SAFRA card presented for verification purposes. Free ticket redeemed must be of the same movie session as the paid ticket. Ticket purchase must be on the same day of promotion. Not valid for advance ticket sales. Not valid for premium priced films (i.e. IMAX, Shaw Theatres premiere, Shaw Theatres Lumiere, Dreamers, 3D Movies (except for MovieMax location for MovieMax members), Hindi/Tamil films, Special Event movies, Film festivals, Special Movie Packages (Family Movie Day, Ladies Nights) movie concert tickets or movie marathons. Limited to a maximum of one (1) free ticket per day for each member. Not valid with other discounts, offers or promotions. Not valid for sneak previews and first 2 weeks’ screening of selected blockbuster titles as required by third party film distributors. Shaw will inform SAFRA of the affected titles at least fourteen (14) days in advance prior to the release dates of the affected titles.  Shaw Theatres Pte Ltd and SAFRA reserve the rights to withdraw or amend the terms and conditions of this promotion without prior notice. Find your nearest Shaw Theatres cinema here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Places of Interest, Entertainment, Tourist Attractions, Movies "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Qatar Airways: Enjoy 12% off selected regular fares and 10% off promotional fares with UOB cards till 30 April 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2018/10/Qatar-Airways-18-Oct-2018-300x157.jpg", "terms": "Experience the world, one destination at a time. Can’t wait for your next getaway? Pick your dream destination and book your flight now on Qatar Airways with UOB Cards! Up to 12% off fares to over 50 destinations 12% off selected regular fares 10% off promotional fares Promo code: UOBQR2020 Booking period: 2 Jan to 30 April 2020 Travel period: 1 Feb to 30 Sep 2020 Terms and Conditions: Sales period: 2 January – 30 April 2020 Travel period: 1 February 2020 – 30 September 2020 Booking must be made using promo code UOBQR2020 to avail of the discount Payment must be done by UOB Credit and Debit Cards only Valid only on Qatar Airways flights from Singapore Valid to the following destinations: Amman, Amsterdam, Antalya, Athens, Atlanta, Baku, Barcelona, Berlin, Bodrum, Boston, Brussels, Bucharest, Budapest, Buenos Aires, Cape Town, Chicago, Copenhagen, Doha, Dublin, Edinburgh, Frankfurt, Geneva, Helsinki, Houston, Istanbul, Kigali, Kilimanjaro, Larnaca, Lisbon, London, Los Angeles, Madrid, Malaga, Malta, Manchester, Miami, Milan, Mogadishu, Moscow, Munich, Muscat, Mykonos, Nairobi, New York, Oslo, Paris, Philadelphia, Pisa, Prague, Rabat, Rome, Santorini, Sofia, St. Petersburg, Stockholm, Tunis, Venice, Vienna, Washington, Warsaw, Zagreb, Zurich All-in fares include all taxes, fees, and surcharges which are subject to currency fluctuation Peak period surcharges may apply Fares are subject to change without prior notice Discount applies to return base fare only of selected fare classes Discount does not apply to taxes and all other surcharges Seats are limited and are subject to availability of the relevant booking class Minimum and maximum stay as well as advance purchase rules apply dependent on the booking class Blackout dates and surcharges may apply. Please refer to the fare rules for details at the time of booking Please refer to the fare rules at the time of booking for changes, cancellations and no-show conditions Any change or cancellation less than 3 hours prior to the stated time of departure will be considered as no-show For travel involving multiple booking classes, the most restrictive fare rules apply to the entire itinerary Standard child/infant discount apply Please note that market-specific promotional fares may be available for selected dates and destinations, and may not be eligible for the discounts under this offer. All available options, together with the applicable terms &amp; conditions for each fare will be displayed at time of booking for you to make your selection Qatar Airway’s terms and conditions will also apply to your booking, please review these at the time of booking Other terms and conditions apply. Please review at the time of booking Book your ticket at www.qatarairways.com/sg Book your hotels online at much less than over-the-counter rates. Popular online hotel booking services include Hotels.com www.Hotels.com, Expedia www.expedia.com.sg and Agoda www.agoda.com Share this with your friends &amp; loved ones on Facebook! For more information on Qatar Airways, visit www.qatarairways.com/sg.  ", "category": "Airlines, Flights, Air Fares, Seats, Tickets Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Watsons: Buy-1-Get-1-Free (1 FOR 1) on selected Watsons Brand, Pure’n Soft & Orita products on 8 Jan 2020\t", "start": "2020-01-08T00:00:00+08:00", "end": "2020-01-08T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/07/Watsons-Feat-13-Jul-2016-300x147.jpg", "vendor": "Watsons", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! For one day only on 8 Jan 2020, enjoy 1-for-1 (buy 1 get 1 free) on participating products across Watsons Brand, Pure’n Soft and Orita  Mix and match as desired. Free item has to be lower or equal value and within the same product range featured. Click on image to enlarge  Terms &amp; conditions All promotions are valid on stipulated date only, unless otherwise stated. Free item has to be lower or equal value and within the same product range featured. Not valid for new, promotional items, pack sets and $2 buys. While stocks last. Products featured are available at selected stores. Prices are subjected to change without prior notice. All information is correct at time of printing. Terms and conditions apply. Find your nearest Watsons outlet here Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! "},
{"name": " POSB PAssion cardholders enjoy 1-FOR-1 offers at RWS, Gardens by the Bay, Cathay Cineplexes, Zoo & many more on 10 April 2020 ", "start": "2020-04-10T00:00:00+08:00", "end": "2020-04-10T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2018/01/POSB-1for1-Tickets-1-Jan-2018-300x158.jpg", "vendor": "POSB", "terms": "Enjoy exclusive 1-for-1 offers on the 10th day of every month! Exclusively with PAssion POSB Debit Card! Be it an exciting day of family fun, a romantic movie date or an enjoyable hangout with friends – POSB has got you covered. Membership is free for a limited time. Click on a link to jump to a specific section 1-for-1 admission tickets to Adventure Cove Waterpark To enjoy the offer, purchase your tickets on www.rwsentosa.com/posb and pay with your PAssion POSB Debit Card. Terms and conditions: 1-for-1 admission tickets to any of the 2 Conservatories: Cloud Forest Flower Dome To enjoy the offer, purchase your tickets at The Canopy ticketing counters and pay with your PAssion POSB Debit Card. Terms and conditions: 1-for-1 admission tickets to S.E.A. Aquarium To enjoy the offer, purchase your tickets on www.rwsentosa.com/posb and pay with your PAssion POSB Debit Card. Terms and conditions: 1-for-1 SENTOSA FUN PASS™: 55 Tokens To enjoy the offer, purchase your bundle on https://store.sentosa.com.sg/promo/sendbs1f1 with promo code ‘SENDBS1F1‘ and pay with your PAssion POSB Debit Card. Terms and conditions: Website: www.sentosa.com.sg Location: 10 Beach View, Singapore 098588 1-for-1 deal to any of the following bundles: To enjoy the offer, purchase your package on www.1fabergroup.com/posbpa and pay with your PAssion POSB Debit Card. Terms and conditions: Website: www.onefabergroup.com Location: 109 Mount Faber Road, Faber Peak, S(099203) 1-for-1 day passes to Wild Wild Wet To enjoy the offer, purchase your passes at Wild Wild Wet ticketing counter and pay with your PAssion POSB Debit Card. Terms and conditions: Website: www.wildwildwet.com/PAPOSBDebit Location: Downtown East, 1 Pasir Ris Close Singapore 519599 1-for-1 admission tickets to any of these wildlife parks: To enjoy the offer, purchase your tickets at the respective ticketing counters and pay with your PAssion POSB Debit Card. Terms and conditions: 1-for-1 movie tickets at all Cathay Cineplexes box offices: To enjoy the offer, purchase your tickets at the respective box office counters and pay with your PAssion POSB Debit Card. Terms and conditions: Website: www.cathaycineplexes.com.sg Locations: AMK Hub | 53 Ang Mo Kio Ave 3, Level 4, S(569933) Causeway Point | 1 Woodlands Square, Causeway Point, Level 7, S(738099) Cineleisure Orchard | 8 Grange Road, Cathay Cineleisure Orchard Levels 4-6, S(239695) E!Hub | 1 Pasir Ris Close, Market Square @ Downtown East, Level 4, S(519599) Jem | 50 Jurong Gateway Road, Jem, Level 5, S(608549) Parkway Parade | 80 Marine Parade Road, Parkway Parade Level 7, S(449269) The Cathay | 2 Handy Road, The Cathay Levels 5-6, S(229233) West Mall | 1 Bukit Batok Central Link, West Mall Level 5, S(658713) 1-for-1 admission tickets to The Polliwogs To enjoy the offer, purchase your tickets at the respective ticketing counters and pay with your PAssion POSB Debit Card. Terms and conditions: Website: www.thepolliwogs.com Locations: Suntec City | 3 Temasek Boulevard, #02-724 Suntec City Mall Tower 4, S(038983) VivoCity | 1 Harbourfront Walk, #03-12 VivoCity, S(098585) For more info, click here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events Places of Interest, Entertainment, Tourist Attractions, Movies "},
{"name": " Big Fish Small Fish: 1 for 1 Signature Fish & Crisps (NTUC Members) (13 Jan – 9 Feb 2020)\t", "start": "2020-01-13T00:00:00+08:00", "end": "2020-02-09T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/Big-Fish-Small-10-Jan-2020-300x158.jpg", "vendor": "Big Fish Small Fish", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1 for 1 Signature Fish &amp; Crisps at Big Fish Small Fish UPDATE 13 Jan 5pm: The promo only applies to Fish &amp; Crisps Valid at all 5 stores (Punggol Container Park #01-K35, Northpoint City, South Wing #02-132,133, Bugis Junction #04-05, Tampines Mall #B1-K3, JCube #03-07) Offer details Offer Date: Valid from 13 Jan to 9 Feb Merchant Name: Big Fish Small Fish Merchant Address: Punggol Container Park | Northpoint City, South Wing | Bugis Junction | Tampines Mall | JCube Merchant Website: https://www.bigfishsmallfish.com/ Terms &amp; conditions: Valid at all 5 stores (Punggol Container Park #01-K35, Northpoint City, South Wing #02-132,133, Bugis Junction #04-05, Tampines Mall #B1-K3, JCube #03-07) Valid from 13 Jan 2020 to 9 Feb 2020 Present NTUC Card upon payment at the cashier counter to enjoy promotion. Discount applies to the lowest priced item. (A la carte Signature Fish &amp; Crisps only). Additional charges for sides are applicable. Promotions cannot be used in conjunction with other discounts or vouchers Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Gong Cha celebrates newest NEX outlet with 1-for-1 Brown Sugar Fresh Milk with Pearl on Friday, 17 January 2020 (12pm & 6pm)\t", "start": "2020-01-17T00:00:00+08:00", "end": "2020-01-17T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/10/Gong-Cha-feat-21-Oct-2019-300x157.jpg", "vendor": "Nex", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Gong Cha’s second outlet in the NorthEast!  From Friday, 17 January, Gong Cha will be serving you from Serangoon, Nex Shopping Mall! At 12 noon and 6pm tomorrow, the first 99 customers will be able to enjoy a 1 for 1 on Gong Cha’s Brown Sugar Fresh Milk with Pearl! On Saturday and Sunday at 10am and 6pm, the first 99 customers will get to enjoy 1 for 1 on Gong Cha’s QQ Passionfruit Green Tea (Saturday) and Caramel Milk Tea (Sunday)! See you guys there! ☺️     Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Triple Three: 1-for-1 lunch buffet with DBS/POSB cards till 30 April 2020 ", "start": "2020-01-02T00:00:00+08:00", "end": "2020-04-30T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/Triple-Three-2-Jan-2020-300x156.jpg", "vendor": "Mandarin Orchard", "terms": "Enjoy 1-for-1 Lunch Buffet at Triple Three Mandarin Orchard Singapore with DBS/POSB Cards UPDATE 5 March: End date has been changed from 31 Dec to 30 April 2020 Japanese-inspired Triple Three boasts an extensive international buffet selection daily, featuring fresh sashimi and sushi, seafood on ice, live cooking stations, a premium roast section and delectable desserts. On Sundays, laze the day away while sipping on sparkling wine and indulging in freshly shucked oysters, while the young ones are entertained at the Kids’ Corner. DBS/POSB cards enjoy 1 for 1 lunch! Two adults only need to pay the price for one adult Looking for dinner (6.30pm – 10.00pm) option? Enjoy 50% off for every second adult when payment is made using any DBS/POSB/UOB credit or debit card. Usual Lunch Buffet prices Monday-Saturday: $78++ per adult; $28++ per child (6-12 yrs) Sunday Family Lunch: $118++ (Adult), $48++ (Child 6 to 12 yrs) All prices are subject to 10% service charge and 7% GST. Lunch hours Monday to Saturday: 12.00pm – 2:30pm Sunday: 12.00pm – 3:00pm Dinner hours Daily: 6.30pm – 10.00pm Prices are subject to change on eve of and on public holidays, and during promotional periods. All prices are subject to 10% service charge and 7% GST. Terms and Conditions: Buffet items may vary. Not applicable on eve of and on PH. DBS General Promotion Terms &amp; Conditions apply, visit www.dbs.com.sg/dbscardstnc. To reserve via Chope, click here. Or call 6831 6271 / 6288 or email dine.orchard[at]meritushotels.com Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Marriott Cafe: 50% off Dinner Buffet with DBS/POSB cards till 30 June 2020 ", "start": "2020-01-02T00:00:00+08:00", "end": "2020-06-30T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2018/07/Marriott-Cafe-5-Jul-2018-300x155.jpg", "vendor": "Singapore Marriott Tang Plaza Hotel", "terms": "Indulge in the freshest International buffet spread at Marriott Cafe, where the chefs take centre-stage to whip up a perfect culinary storm for you. UPDATE 18 March: Promotion extended till 30 June 2020 Savour renowned local dishes such as the Singapore Chilli Crab, Chicken Rice or visit the hot buffet line for an extensive array of premium meat dishes such as Crispy Pork Saddle with Pancetta, Prunes and Mixed Herbs, Roast Beef and other roasted delights cooked to perfection at the Beech Oven Station. For those with a sweet tooth, their signature desserts include the Sticky Date Pudding that will make for pure palate pleasers after a satisfying meal. Buffet items may vary. DBS/POSB cardholders enjoy 50% off dinner buffet That comes to as low as $39++ per adult after discount  Dinner Buffet Sunday to Thursday/ Friday &amp; Saturday Adult: $78++ / $88++ Child: $38++ / $40++ (Aged 5 to 12 years old) Prices above are subject to 10% service charge and 7% Goods and Services Tax (GST). Black-out dates will apply. Click here for the menu and pricing Reserve now by calling (65) 6831 4605. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " LiHO: Enjoy 1-for-1 any regular priced drinks on Friday 3 January 2020, 230pm-630pm\t", "start": "2020-01-03T00:00:00+08:00", "end": "2020-01-03T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/LiHO-feat-3-Jan-2020-300x156.jpg", "vendor": "LiHO", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1 for 1 All LiHO Drinks on Friday, 3 January 2020 Simply flash this picture from the Telegram group to their counter and show them that you’re in their group! Click here to join the Telegram group Terms &amp; conditions Customers will be able to redeem 1 free drink with the purchase of any 1 regular priced drink Second cup of drinks must be the same Customer can only redeem 1 free drink in a single transaction Not valid with other promotions, discounts and corporate privileges Promotion is not valid for use with other LiHO TEA vouchers and/or RTG vouchers Redemption is valid from 230pm-630pm Valid for redemption at all outlets Promotion valid only today, 3rd Jan from 230pm-630pm   Find your nearest LiHO outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " SUKI-YA: Maybank cardholders enjoy 1-for-1 Shabu Shabu Lunch Buffet from Mondays to Thursdays till 31 March 2020\t", "start": "2020-01-02T00:00:00+08:00", "end": "2020-03-31T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2018/04/SUKIYA-feat-2-Apr-2018-300x156.jpg", "vendor": "SUKI-YA", "terms": "From 2 January till 31 March 2020, enjoy 1-for-1 Shabu Shabu Lunch Buffet when you pay with a Maybank card! Valid from 2 January till 31 March 2020, both dates inclusive from Mondays to Thursday, 11.30am – 4pm (60 mins)*. Last order at 3.30pm. Offer is not valid at Suki-Ya Plaza Singapura and Bugis+. *Offer is valid on Monday – Thursday, 11.30am – 3pm (60 mins) at Marina Square, and 12pm – 3pm (60 mins) at Suki-Ya KIN VivoCity. Last order at 2.30pm.  Valid on regular buffet menu only. Check out the menu and pricing below  Terms &amp; conditions Promotion only applicable with a Maybank credit/debit card. Offer is valid from 2 January till 31 March 2020, both dates inclusive. Offer is valid Mondays to Thursday, 11.30am – 4pm (60 mins)*. Last order at 3.30pm. *Offer is valid on Monday – Thursday, 11.30am – 3pm (60 mins) at Marina Square, and 12pm – 3pm (60 mins) at Suki-Ya KIN VivoCity. Last order at 2.30pm. Offer is not valid at Suki-Ya Plaza Singapura and Bugis+. Offer is valid on regular buffet menu only. Offer is not valid on all premium menu, any additional top-ups or ala carte drinks (e.g. beer, sake, water). Offer is applicable on the billed amount before prevailing GST and service charges. Item of equal or lower value will be complimentary. Not valid on Public Holiday, special occasions e.g. Mother’s Day and their respective Eves of. Limited to 1 redemption per card, per bill, per table, per party and per occasion. Diners from the same party are not allowed to split bills and/or tables. Valid for dine-in only, not applicable for private events, take-away or bookings of more than 10pax. Offer cannot be used in conjunction with other promotions, discounts, offers, dining apps or any other credit/debit card privileges. Management reserves the right to amend menu, prices, promotions and/or terms and conditions without prior notice. Chope your seats here:  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Triple Three: 1-for-1 lunch buffet with DBS/POSB cards till 30 April 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/Triple-Three-2-Jan-2020-300x156.jpg", "terms": "Enjoy 1-for-1 Lunch Buffet at Triple Three Mandarin Orchard Singapore with DBS/POSB Cards UPDATE 5 March: End date has been changed from 31 Dec to 30 April 2020 Japanese-inspired Triple Three boasts an extensive international buffet selection daily, featuring fresh sashimi and sushi, seafood on ice, live cooking stations, a premium roast section and delectable desserts. On Sundays, laze the day away while sipping on sparkling wine and indulging in freshly shucked oysters, while the young ones are entertained at the Kids’ Corner. DBS/POSB cards enjoy 1 for 1 lunch! Two adults only need to pay the price for one adult Looking for dinner (6.30pm – 10.00pm) option? Enjoy 50% off for every second adult when payment is made using any DBS/POSB/UOB credit or debit card. Usual Lunch Buffet prices Monday-Saturday: $78++ per adult; $28++ per child (6-12 yrs) Sunday Family Lunch: $118++ (Adult), $48++ (Child 6 to 12 yrs) All prices are subject to 10% service charge and 7% GST. Lunch hours Monday to Saturday: 12.00pm – 2:30pm Sunday: 12.00pm – 3:00pm Dinner hours Daily: 6.30pm – 10.00pm Prices are subject to change on eve of and on public holidays, and during promotional periods. All prices are subject to 10% service charge and 7% GST. Terms and Conditions: Buffet items may vary. Not applicable on eve of and on PH. DBS General Promotion Terms &amp; Conditions apply, visit www.dbs.com.sg/dbscardstnc. To reserve via Chope, click here. Or call 6831 6271 / 6288 or email dine.orchard[at]meritushotels.com Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Qatar Airways: Enjoy 12% off selected regular fares and 10% off promotional fares with UOB cards till 30 April 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2018/10/Qatar-Airways-18-Oct-2018-300x157.jpg", "terms": "Experience the world, one destination at a time. Can’t wait for your next getaway? Pick your dream destination and book your flight now on Qatar Airways with UOB Cards! Up to 12% off fares to over 50 destinations 12% off selected regular fares 10% off promotional fares Promo code: UOBQR2020 Booking period: 2 Jan to 30 April 2020 Travel period: 1 Feb to 30 Sep 2020 Terms and Conditions: Sales period: 2 January – 30 April 2020 Travel period: 1 February 2020 – 30 September 2020 Booking must be made using promo code UOBQR2020 to avail of the discount Payment must be done by UOB Credit and Debit Cards only Valid only on Qatar Airways flights from Singapore Valid to the following destinations: Amman, Amsterdam, Antalya, Athens, Atlanta, Baku, Barcelona, Berlin, Bodrum, Boston, Brussels, Bucharest, Budapest, Buenos Aires, Cape Town, Chicago, Copenhagen, Doha, Dublin, Edinburgh, Frankfurt, Geneva, Helsinki, Houston, Istanbul, Kigali, Kilimanjaro, Larnaca, Lisbon, London, Los Angeles, Madrid, Malaga, Malta, Manchester, Miami, Milan, Mogadishu, Moscow, Munich, Muscat, Mykonos, Nairobi, New York, Oslo, Paris, Philadelphia, Pisa, Prague, Rabat, Rome, Santorini, Sofia, St. Petersburg, Stockholm, Tunis, Venice, Vienna, Washington, Warsaw, Zagreb, Zurich All-in fares include all taxes, fees, and surcharges which are subject to currency fluctuation Peak period surcharges may apply Fares are subject to change without prior notice Discount applies to return base fare only of selected fare classes Discount does not apply to taxes and all other surcharges Seats are limited and are subject to availability of the relevant booking class Minimum and maximum stay as well as advance purchase rules apply dependent on the booking class Blackout dates and surcharges may apply. Please refer to the fare rules for details at the time of booking Please refer to the fare rules at the time of booking for changes, cancellations and no-show conditions Any change or cancellation less than 3 hours prior to the stated time of departure will be considered as no-show For travel involving multiple booking classes, the most restrictive fare rules apply to the entire itinerary Standard child/infant discount apply Please note that market-specific promotional fares may be available for selected dates and destinations, and may not be eligible for the discounts under this offer. All available options, together with the applicable terms &amp; conditions for each fare will be displayed at time of booking for you to make your selection Qatar Airway’s terms and conditions will also apply to your booking, please review these at the time of booking Other terms and conditions apply. Please review at the time of booking Book your ticket at www.qatarairways.com/sg Book your hotels online at much less than over-the-counter rates. Popular online hotel booking services include Hotels.com www.Hotels.com, Expedia www.expedia.com.sg and Agoda www.agoda.com Share this with your friends &amp; loved ones on Facebook! For more information on Qatar Airways, visit www.qatarairways.com/sg.  ", "category": "Airlines, Flights, Air Fares, Seats, Tickets Credit Cards, Prepaid Cards, Banks Events "},
{"name": " McDonald’s will be offering 1-for-1 Filet-O-Fish® burger and/or Large Fries from 29 – 31 December 2019 ", "start": "2019-12-29T00:00:00+08:00", "end": "2019-12-31T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/McDonalds-filet-18-Dec-2019-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Filet-O-Fish® and/or Large Fries via McDonald’s App  This deal is only valid from 29 – 31 December 2019, while stocks last. Limited to one redemption per day. Filet-O-Fish®. The catch of the day is sure a great catch at McDonald’s. A fish filet, smothered with tangy tartar sauce and half a slice of cheese between tender steamed buns is simply pure ocean heaven. Note: Deal may not be available at all outlets, check app for detailed info  Valid from 29 Dec to 31 Dec, between 12noon-4am, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. This deal may not be used in conjunction with any other promotions or discounts. Valid at all stores except institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  For more info, click here. Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Mr Bean: 1-for-1 set of Hazelnut Pancake + Pearly Soy Milk deal from 29 December 2019 ", "start": "2019-12-29T00:00:00+08:00", "end": "2020-01-27T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Mr-Bean-29-Dec-2019-300x155.jpg", "vendor": "Qoo10", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Mr Bean [1 set for 1 set] – 1 Hazelnut Pancake + 1 Pearly Soy Milk FREE 1 Hazelnut Pancake + 1 Pearly Soy Milk $3.90 (U.P. $7.80) A total of 54 particpating outlets are open for this offer. Do note that certain outlets are excluded. Do remember that redemption starts from 2 Jan (11am) – 31 Jan 2020 (ends 8pm). Can be redeemed islandwide at 54 participating Mr Bean outlets (excluding schools, polyclinics &amp; hospitals) This deal must be pre-purchased online at www.qoo10.sg Price Retail Price: S$7.80 Q-Price: S$4.30 Sale Price: S$3.90  Terms &amp; Conditions Valid from 2 January to 31 January 2020, 11am – 8pm Can be redeemed islandwide at 54 participating Mr Bean outlets (excluding schools, polyclinics &amp; hospitals) Strictly NO extension or cancellation of vouchers once expired Redemption strictly via MOBILE app only. (No printed voucher is accepted) Mr Bean reserves all rights to reject any redemptions that do not adhere to the Terms &amp; Conditions. Fore more info and to buy, visit www.qoo10.sg Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " LiHO is offering 1-for-1 for any regular priced drinks all-day till 2 January 2020\t", "start": "2020-01-01T00:00:00+08:00", "end": "2020-01-02T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/LiHO-feat-2-Jan-2020-300x159.jpg", "vendor": "LiHO", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1 for 1 All LiHO Drinks From 1/1-2/1 2020 Simply flash this picture from the Telegram group to their counter and show them that you’re in their group! Click here to join the Telegram group Terms &amp; conditions Customers will be able to redeem 1 free drink with the purchase of any 1 regular priced drink Second cup of drinks must be the same Customer can only redeem 1 free drink in a single transaction Not valid with other promotions, discounts and corporate privileges Promotion is not valid for use with other LiHO TEA vouchers and/or RTG vouchers Redemption is valid all day Valid for redemption at all outlets Promotion valid only from: 1st Jan to 2nd Jan 2020   Find your nearest LiHO outlet here Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Andersen’s of Denmark is offering 1-for-1 Light Cocoa Chip flavour till 31 Jan 2020\t", "start": "2020-01-01T00:00:00+08:00", "end": "2020-01-31T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/01/Andersens-feat-1-Jan-2020-300x156.jpg", "vendor": "Andersen&#39;s of Denmark", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Start your year right and celebrate with Andersen’s of Denmark’s new ice cream flavor in an irresistible deal! 1-for-1 for Light Cocoa Chip flavour Additional $1 for the choice of cone Valid only for light Cocoa chip flavor. Valid from 1st to 31st January. Not valid with other promotions, discount cards or vouchers  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Subway: Buy One, Get One Free at Suntec City outlet on 30 December 2019\t", "start": "2019-12-30T00:00:00+08:00", "end": "2019-12-30T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/10/Subway-feat-25-Oct-2019-300x157.jpg", "vendor": "Suntec City Mall", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! One Day Only: Buy One, Get One FREE! Grab a friend, and head down to Subway’s Suntec City Restaurant to celebrate their grand opening today * With the purchase of any drinks  Only available at Suntec City outlet on the 30th Dec 2019. Buy one 6″ sub and get another free 6*sub with the purchase of a drink. Free sub will be the lower price of the two subs. For a limited time only in selected Subway restaurants in Singapore. Visual are for illustration purposes only. SUBWAY is a Registered Trademark of Subway IP Inc ©2018 Subway IP Inc Outlet Details Suntec City #B1-173, Fountain Court  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " The Line at Shangri-La Hotel: 1-for-1 lunch/dinner buffet on Mondays with DBS/POSB cards from 6 Jan – 30 Mar 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/01/The-Line-3-Jan-2019-300x157.jpg", "terms": "Featuring 16 live kitchens, The Line offers a sumptuous international buffet that is feted as one of the best in Singapore. UPDATE 3 Jan: January slots are fully booked! February/March slots are currently unavailable UPDATE 7 Jan: Fully booked! Dishes are freshly prepared a la minute, enabling diners to watch the chefs in action. Highlights include the Crustacean Bar, with its appetizing display of fresh seafood such as oysters, prawns and crabs that changes based on what is available. Enjoy 1-for-1 buffet offer on Monday lunch and dinner exclusive for DBS/POSB cards. Advanced reservations are required and must be made online through Shangri-La Hotel, Singapore’s website. Valid for lunch and dinner, every Monday from 6 January to 30 March 2020. Valid for the first 100 adults per meal time in January 2020 and 200 adults per meal time in February and March 2020. Lunch Buffet 12noon – 2.30pm (Monday to Friday) 12noon – 3pm (Saturday, Sunday and Public Holidays) Dinner Buffet 6pm – 10pm (Monday to Sunday) Buffet pricing  Terms and Conditions: Book your table online here now! Note: Please select “DBS/POSB 1-for-1 Buffet at The Line” in the promotion dropdown box on the booking page to enjoy this offer. For more info, click here. Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Fast Food, Restaurants, Dining, Groceries "},
{"name": " Agoda: UOB cards enjoy up to 75% off + additional 7% off worldwide hotels! Book by 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/08/Agoda-Logo-17-Aug-2016-300x148.jpg", "terms": "Enjoy great savings at Agoda.com with UOB cards at www.agoda.com/uob.  Up to 75% off + additional 7% off worldwide exclusively for UOB Cardmembers! Book now at www.agoda.com/uob Terms &amp; Conditions For more info, visit www.agoda.com/uob. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events Vacations, Travel Deals, Cruises, Luggage Bags, Equipment, Hotels "},
{"name": " McDonald’s will be offering 1-for-1 Happy Sharing Box® B from 25 – 28 December 2019\t", "start": "2019-12-25T00:00:00+08:00", "end": "2019-12-28T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Happy-Sharing-Box-B-feat-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Happy Sharing Box® B via McDonald’s App  This deal is only valid from 25 – 28 December 2019, while stocks last. Limited to one redemption per day. Happy Sharing Box® B. Chicken McNuggets® (6pc) + McWings® (4pc). Perfect for small groups and tiny cravings. Cosy up with your favourite Chicken McNuggets® and McWings®! Note: Deal may not be available at all outlets, check app for detailed info  Valid from 25 Dec to 28 Dec, between 12noon-4am, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. This deal may not be used in conjunction with any other promotions or discounts. Valid at all stores except institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg/ allergens-listing Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  Click on image to enlarge  For more info, click here. Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Singtel customers enjoy 1-for-1 movies everyday at all Cathay Cineplexes till 1 January 2020\t", "start": "2019-12-24T00:00:00+08:00", "end": "2020-01-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Singtel-26-Dec-2019-300x157.jpg", "vendor": "Cathay Cineplexes", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! The deal is back and even better!   Enjoy 1-for-1 movies everyday at all Cathay Cineplexes! Simply login to My Singtel app &gt; Rewards, flash the barcode on the promo page at the box office ticketing counter to enjoy a FREE movie ticket when you purchase one movie ticket. Limited to the first 500 customers daily at any Cathay Cineplex outlet, while stocks last. T&amp;Cs apply. Not applicable to Singtel Prepaid or Corporate BRN customers. RELATED: M1 customers enjoy 1-for-1 Shaw Theatres movie tickets on Sundays!  Terms and conditions: 1-for-1 movie ticket is valid to the first 500 customers everyday at any Cathay Cineplex outlet from 24 December 2019 to 1 January 2020 1-for-1 movie ticket is not applicable to Singtel Prepaid or Corporate BRN customers. Limited to 1 complimentary Cathay Cineplex Standard Ticket per customer per day. 1-for-1 movie ticket must be purchased for the same movie and show date/time. Not valid for 3D, Tamil, Hindi, Special Priced Tickets, Movie Marathon, Platinum Movie Suites and Film Festival Title. Not valid for other promotions, credit card discounts, vouchers and passes. Not valid for online / kiosk / mobile / corporate bookings. Not exchangeable or refundable for cash, products or other services. Singtel shall not be liable in any way whatsoever for any matter arising from, relating to and/or attributable to such products and/or services. Singtel and merchant reserves the right to terminate, suspend or cancel (in whole or in part) this promotion. Singtel and merchant reserves the right to amend these terms and conditions of this promotion from time to time without prior notice and without any liability. Terms and conditions of Singtel and/or any other third parties may apply in addition to these terms. Singtel’s General Terms and Conditions of Service(s) shall apply. Singtel’s General Terms and Conditions of Service(s) can be found at www.singtel.com/terms-general (“General Terms”) and may be amended from time to time. Download the My Singtel app from Apple App Store or Google Play Store. Find your nearest cinema here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Places of Interest, Entertainment, Tourist Attractions, Movies Singtel, Starhub & M1 Phones, Broadband & Pay TV Offers "},
{"name": " McDonald’s will be offering 1-for-1 Hotcakes with Sausage from 23 – 24 December 2019\t", "start": "2019-12-23T00:00:00+08:00", "end": "2019-12-24T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Hotcakes-with-Sausage-feat-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Hotcakes with Sausage via McDonald’s App  This deal is only valid from 23 – 24 December 2019, while stocks last. Limited to one redemption per day. Hotcakes with Sausage. Jump-start the day with this classic sweet-and-savoury combo. Fluffy Hotcakes drizzled with syrup and served alongside a delicious chicken sausage. Note: Deal may not be available at all outlets, check app for detailed info  Valid on 23 Dec and 24 Dec, between 4am-11am, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. This deal may not be used in conjunction with any other promotions or discounts. This deal can only be applied to ala carte orders only, not applicable to Extra Value Meals or any other combinations. Valid at all stores except LIDO, institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg/ allergens-listing Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  Click on image to enlarge  For more info, click here. Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Starbucks: Cardholders enjoy a 1-for-1 treat on Venti-sized Holiday French Vanilla Latte, Peppermint Mocha and Toffee Nut Crunch Latte (16 – 20 Dec 2019)\t", "start": "2019-12-16T00:00:00+08:00", "end": "2019-12-20T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Starbucks-feat-14-Dec-2019-300x158.jpg", "vendor": "Starbucks", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Three cheers!  Enjoy a 1-for-1 treat on Venti-sized Holiday French Vanilla Latte, Peppermint Mocha and Toffee Nut Crunch Latte Applicable when you pay with your Starbucks card and redeem the reward. Check that there’s a reward on your account before heading down as this deal **may only** be for selected cardholders Login to Starbucks or launch the Starbucks app and find the reward in your Card account from 16 – 20 Dec 2019  *Redeemable when you pay with your Starbucks Card. Valid from 16 to 20 Dec (Mon-Fri) on Venti-sized Holiday French Vanilla Latte (hot, iced or blended), Peppermint Mocha (hot, iced or blended) and Toffee Nut Crunch Latte (hot, iced or blended) at all Starbucks Singapore stores (except for stores located at Changi Airport including Jewel). Limited to three vouchers per member, each voucher limited to the same drink redemption, for a one-time use only. Limited to 1 redemption per transaction. Offer is while stocks last. Offer is exclusive to your Starbucks account and is non-transferable. Not valid on Mobile Order &amp; Pay, delivery orders or with any other promotions or privileges. Other terms and conditions apply.  There’s something about drinking coffee this time of year. It just tastes better. Maybe it’s that the holidays give us permission to get excited about the small stuff. Here’s the enjoying the small, good stuff. Mmm, Toffee Nut Crunch Latte, so luxuriously buttery and sweet. Starbucks signature espresso is combined with steamed milk and toffee nut sauce before being topped with whipped cream and crunchy toffee nut bits. Sipping one feels like a big, warm hug. Available hot, iced and blended. Hot and cool at the same time, the Peppermint Mocha is like a party for your taste buds. This holiday classic is made with Starbucks signature espresso, steamed milk, sweet mocha sauce and peppermint-flavored syrup. It’s all topped off with whipped cream, a dash of mocha drizzle and crunchy red and white candy bits. Available hot, iced and blended. Rich, smooth, and oh-so-festive. This creamy beverage brings together Starbucks signature espresso and creamy French Vanilla flavor before being topped with smooth butterfly pea cold foam. The drink is then finished with festive blue and white sprinkles. Available hot, iced and blended. Merry Coffee. Find your nearest Starbucks store here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s will be offering 1-for-1 McSpicy® Burger from 17 – 22 December 2019 ", "start": "2019-12-17T00:00:00+08:00", "end": "2019-12-22T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/McDonalds-feat-9-Sep-2019-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 McSpicy® Burger via McDonald’s App This deal is only valid from 17 – 22 Dec, available while stock last. UPDATE 17 Dec: The deal has been extended till 22 December! Limited to one redemption per day. Note: Deal may not be available at all outlets, check app for detailed info  Terms &amp; Conditions Valid from 17 Dec to 22 Dec, between 12noon-4am, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. This deal may not be used in conjunction with any other promotions or discounts. This deal can only be applied to ala carte orders only, not applicable to Extra Value Meals or any other combinations. Valid at all stores except institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg/ allergens-listing Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  Click on image to enlarge  For more info, click here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Haagen-Dazs shops are offering 1-for-1 double scoops in the latest “Buy Double Get Double” promotion till 20 December 2019\t", "start": "2019-12-16T00:00:00+08:00", "end": "2019-12-20T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2018/03/HaagenDazs-outlets-feat-9-Mar-2018-300x154.jpg", "vendor": "Haagen-Dazs", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Make this holiday season extraordinary, with a special treat from Häagen-Dazs. Invite your family and friends down to Häagen-Dazs stores to enjoy the “Buy Double Get Double” promotion! Only available from 16-20 Dec, so make sure to mark your calendars. Conditions: Promotion only available from 16-20 Dec 2019 Promotion is valid for takeaway only There will be additional charges applied for toppings Promotion cannot be applied together with VIP privilege or other promotions The Double Scoop usually retails at S$10.90  Find your nearest outlet here Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " LiHO is offering 1-for-1 Da Hong Pao Milk Tea with Brown Sugar Pearl at orchardgateway outlet till 24 December 2019\t", "start": "2019-12-13T00:00:00+08:00", "end": "2019-12-24T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/01/LiHO-feat-16-Jan-2019-300x155.jpg", "vendor": "Orchard Gateway", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 12 Days Countdown to Christmas celebration at orchardgateway  1-For-1 Da Hong Pao Milk Tea + Brown Sugar Pearl (L) at $4.90 (U.P. $9.80) Only valid at orchardgateway outlet (#B2-13) from 13 December to 24 December 2019. Any additional toppings are chargeable Only valid for large Da Hong Pao Milk Tea + Brown Sugar Pearl Flash this image to the cashier to enjoy Limited to 1 set per customer Outlet details liho tea 里喝 orchardgateway #B2-13  Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Fairprice 2-Days Specials: Kinder Bueno, Tesco Variety Biscuits, Buy-2-Get-2-Free Darlie & more deals for 2-days only from 14 – 15 Dec 2019\t", "start": "2019-12-14T00:00:00+08:00", "end": "2019-12-15T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Fairprice-feat-2Day-14-Dec-2019-300x157.jpg", "vendor": "NTUC Fairprice", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 2 DAYS ONLY 14-15 DECEMBER Two weekends to Christmas, two days to stock up with these delightful specials at Fairprice stores and online! *Limited to 4 sets per product per customer, while stocks last. The promotion is also available at Fairprice’s Online store at www.fairprice.com.sg. *Not all products listed are available on FairPrice On. Listed are OCEAN FRESH DELITE Frozen Cod Steak 500g U.P. $36.95 BERINGER Founders’ Estate Chardonnay/Merlot/ Cabernet Sauvignon 750ml U.P. 2 for $76 COCA-COLA Canned Drink Classic/No Sugar/ Stevia/Vanilla/Light 12’s x 320ml U.P. $9.30 NESCAFE Original/Less Sugar/ Zero Sugar/ Brown Sugar 35’s/30’s x 9g – 19g 1 U.P. 2 for $12.30 KINDER BUENO T2 10 Pack 63g U.P. $16.80 ENSURE LIFE Wheat/Vanilla 850g U.P. $37.50 TESCO Variety Biscuits 700g U.P. $6.90 KJELDSENS Butter Cookies 656g U.P. $9.60 DARLIE Double Action Toothpaste 175g DOVE Body Wash Assorted 1L/1000g U.P. 3 for $29.10 Click on image to enlarge  Find your nearest Fairprice outlet here Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s: Free OREO® McFlurry® with any purchase via the app from 14 – 16 December 2019\t", "start": "2019-12-14T00:00:00+08:00", "end": "2019-12-16T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/McDonalds-14-Dec-2019-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Free OREO® McFlurry® with any purchase via McDonald’s App  This deal is only valid from 14 – 16 December 2019, while stocks last. Valid from 14 Dec to 16 Dec, between 12noon-4am OREO® McFlurry®. If you like flurrying it all up, how about some vanilla soft-serve whisked into a lovely concoction with sinful Oreo cookie bits? Like the idea? Then you’ll love the taste.  Terms &amp; conditions Valid from 14 Dec to 16 Dec, between 12noon-4am, available while stocks last. Visuals are for illustration purposes. Limited to one redemption per transaction. Deal is valid with a minimum purchase of $0.80. This deal may not be used in conjunction with any other promotions or discounts. Valid at all stores except institutional stores and delivery. You must log in before you can redeem any deals. Once you have redeemed this deal, you will not be able to redeem this again until 24 hours later. This deal cannot be exchanged for cash. No refunds allowed. Products may contain allergens. Full allergens list can be found at: www.mcdonalds.com.sg/ allergens-listing Prices vary according to location. McDonald’s reserves the right to change the offers, menu and offers period any time without prior notice. Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  Click on image to enlarge  For more info, click here. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " The Manhattan FISH MARKET is offering 1-for-1 breakfast set on weekends at Causeway Point till 5 Jan 2020\t", "start": "2019-12-14T00:00:00+08:00", "end": "2020-01-05T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/The-Manhattan-FISH-feat-13-Dec-2019-300x157.jpg", "vendor": "Causeway Point", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Start your great morning with 1 for 1 breakfast set and free flow of coffee or tea at The Manhattan FISH MARKET, Causeway Point. Sharing the joy for only 4 weekends from tomorrow till 5 Jan 2020. Manhattan FISH MARKET Causeway Point Causeway Point 1 Woodlands Square, Causeway Point #02-34/K1, Singapore 738099 Tel: +65 6894 1500       Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Creative’s March Fest offers savings of up to 60% off till 31 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Creatives-March-Fest-21-Mar-2020-300x158.jpg", "terms": "Creative March Fest! Awesome savings up to 60% off! To sweeten the deal, get $30 off with every purchase above $200! Key in promo code: SAVE30. Get $50 off with every purchase above $300! Key in promo code: SAVE50. From home entertainment sound bars which you can enjoy great family time for movies to personal true wireless earbuds featuring a whooping 39hrs battery life, you are sure to find something you love! Enjoy free shipping on orders $59 and more! Visit creative.com/marchfest to view all deals!  Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Computers, Tablets, Accessories, Software Events TVs, Speakers, Blu-Ray, Home Theatre, Headphones, Earphones "},
{"name": " Fairprice: Ben & Jerry’s ice cream pints including the new “Chip Happens” flavour are going at 2-for-$19.90 (U.P. $27.80) till 25 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Fairprice-Ben-feat-19-Mar-2020-300x157.jpg", "terms": "Stock up on Ben &amp; Jerry’s ice cream with NTUC Fairprice’s latest weekly promotion. The new “Chip Happens” Netflix flavour is described as “a cold mess of chocolate ice cream with fudge chips and crunchy potato chip swirls”. Grab two tubs of Ben &amp; Jerry’s assorted for $19.90 (usual $27.80) That’s about $9.95 per tub. Limited to 6 units per purchase The promotion is also available at Fairprice’s Online store at www.fairprice.com.sg. *Not all products listed are available on FairPrice On. Click on image to enlarge  Find your nearest Fairprice outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Qatar Airways: Enjoy 12% off selected regular fares and 10% off promotional fares with UOB cards till 30 April 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2018/10/Qatar-Airways-18-Oct-2018-300x157.jpg", "terms": "Experience the world, one destination at a time. Can’t wait for your next getaway? Pick your dream destination and book your flight now on Qatar Airways with UOB Cards! Up to 12% off fares to over 50 destinations 12% off selected regular fares 10% off promotional fares Promo code: UOBQR2020 Booking period: 2 Jan to 30 April 2020 Travel period: 1 Feb to 30 Sep 2020 Terms and Conditions: Sales period: 2 January – 30 April 2020 Travel period: 1 February 2020 – 30 September 2020 Booking must be made using promo code UOBQR2020 to avail of the discount Payment must be done by UOB Credit and Debit Cards only Valid only on Qatar Airways flights from Singapore Valid to the following destinations: Amman, Amsterdam, Antalya, Athens, Atlanta, Baku, Barcelona, Berlin, Bodrum, Boston, Brussels, Bucharest, Budapest, Buenos Aires, Cape Town, Chicago, Copenhagen, Doha, Dublin, Edinburgh, Frankfurt, Geneva, Helsinki, Houston, Istanbul, Kigali, Kilimanjaro, Larnaca, Lisbon, London, Los Angeles, Madrid, Malaga, Malta, Manchester, Miami, Milan, Mogadishu, Moscow, Munich, Muscat, Mykonos, Nairobi, New York, Oslo, Paris, Philadelphia, Pisa, Prague, Rabat, Rome, Santorini, Sofia, St. Petersburg, Stockholm, Tunis, Venice, Vienna, Washington, Warsaw, Zagreb, Zurich All-in fares include all taxes, fees, and surcharges which are subject to currency fluctuation Peak period surcharges may apply Fares are subject to change without prior notice Discount applies to return base fare only of selected fare classes Discount does not apply to taxes and all other surcharges Seats are limited and are subject to availability of the relevant booking class Minimum and maximum stay as well as advance purchase rules apply dependent on the booking class Blackout dates and surcharges may apply. Please refer to the fare rules for details at the time of booking Please refer to the fare rules at the time of booking for changes, cancellations and no-show conditions Any change or cancellation less than 3 hours prior to the stated time of departure will be considered as no-show For travel involving multiple booking classes, the most restrictive fare rules apply to the entire itinerary Standard child/infant discount apply Please note that market-specific promotional fares may be available for selected dates and destinations, and may not be eligible for the discounts under this offer. All available options, together with the applicable terms &amp; conditions for each fare will be displayed at time of booking for you to make your selection Qatar Airway’s terms and conditions will also apply to your booking, please review these at the time of booking Other terms and conditions apply. Please review at the time of booking Book your ticket at www.qatarairways.com/sg Book your hotels online at much less than over-the-counter rates. Popular online hotel booking services include Hotels.com www.Hotels.com, Expedia www.expedia.com.sg and Agoda www.agoda.com Share this with your friends &amp; loved ones on Facebook! For more information on Qatar Airways, visit www.qatarairways.com/sg.  ", "category": "Airlines, Flights, Air Fares, Seats, Tickets Credit Cards, Prepaid Cards, Banks Events "},
{"name": " 1-for-1 Festive Buffet till 30 December 2019 at J65, Hotel Jen Tanglin by Shangri-La\t", "start": "2019-12-11T00:00:00+08:00", "end": "2019-12-30T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/1for1-Festive-Buffet-11-Dec-2019-300x158.jpg", "vendor": "Hotel Jen Tanglin Singapore", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! In celebration of welcoming 2020, Hotel Jen Tanglin Singapore is offering ONE-FOR-ONE BUFFET at J65! Simply quote “Hi2020” upon booking to enjoy this special offer. Highlights include lobsters on ice, Asian percik style turkey, Christmas log cakes and durian pengat (Sunday Brunch only). Weekday Buffet Lunch 12pm to 2.30pm | Menu SGD 38++ per person Saturday High-Tea Buffet 12pm to 3pm | Menu SGD 68++ per person Sunday Brunch 12pm to 3pm | Menu SGD 88++ per person For more information, please call (65) 6831 4374 or email j65@hoteljen.com Book here: bit.ly/j65reservation  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Watsons: Buy-1-Get-1-Free (1 FOR 1) on selected Watsons Brand, Pure’n Soft & Orita products on 11 Dec 2019\t", "start": "2019-12-11T00:00:00+08:00", "end": "2019-12-11T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/07/Watsons-Feat-13-Jul-2016-300x147.jpg", "vendor": "Watsons", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! For one day only on 11 Dec 2019, enjoy 1-for-1 (buy 1 get 1 free) on participating products across Watsons Brand, Pure’n Soft and Orita  Click on image to enlarge  Terms &amp; conditions All promotions are valid on 11 Dec 2019 only, unless otherwise stated. Free item has to be lower or equal value and within the same product range featured. Not valid for new, promotional items, pack sets and $2 buys. While stocks last. Products featured are available at selected stores. Prices are subjected to change without prior notice. All information is correct at time of printing. Terms and conditions apply. Find your nearest Watsons outlet here Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. "},
{"name": " OLDTOWN White Coffee: 1-for-1 selected main course items with DBS/POSB cards on weekdays till 29 May 2020\t", "start": "2019-12-02T00:00:00+08:00", "end": "2020-05-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/OLDTOWN-White-Coffee-5-Dec-2019-300x155.jpg", "vendor": "OLDTOWN White Coffee", "terms": "1-for-1 selected main course items Enjoy 1-for-1 on the following items at all OLDTOWN White Coffee outlets Valid on Mondays to Fridays, from 6PM till closing only.   Promotion Period: From now till 31/05/2020 Terms and Conditions: Valid on Mondays to Fridays, from 6PM till closing only. Applicable to OLDTOWN Hainanese Chicken Chop with Rice or OLDTOWN Dry Springy Noodles with Chicken Chop only. Complimentary item is accorded to dish with equal or lower value. DBS General Promotion Terms &amp; Conditions apply, visit www.dbs.com.sg/dbscardstnc. Find your nearest outlet here. For more info, click here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s will be offering 1-for-1 Sausage McMuffin® with Egg from 11 – 13 December 2019 ", "start": "2019-12-11T00:00:00+08:00", "end": "2019-12-13T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/Sausage-McMuffin®-with-Egg-2-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Sausage McMuffin® with Egg® via McDonald’s App  UPDATE: 6pcs McNuggets 1-for-1 has also been extended till 11 Dec This deal is only valid from 11 – 13 December 2019, while stocks last. Limited to one redemption per day. Sausage McMuffin® with Egg®. Sumptuous chicken sausage and an egg done sunny side-up served between perfectly toasted muffins. Note: Deal may not be available at all outlets, check app for detailed info  Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  Click on image to enlarge  For more info, click here. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Prata Wala will be offering 1 FOR 1 Curry Chicken Biryani at all outlets on 10 December 2019\t", "start": "2019-12-10T00:00:00+08:00", "end": "2019-12-10T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/Prata-Wala-feat-9-Sep-2019-300x157.jpg", "vendor": "Prata Wala", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Prata Wala fans, rejoice!  They will having a 1-for-1 special for their best-selling biryani, Curry Chicken Biryani on 10 December (Tuesday) at all Prata Wala outlets! To redeem, simply Like and Follow their Facebook page &amp; show it to the staff. Available from 11am onwards. While stocks last.  Terms &amp; conditions: Maximum purchase of 2 Curry Chicken Biryani per customer. While stocks last. Valid for dine-in and takeaway. Offer is not valid in conjunction with other offers, privileges, or vouchers. Find your nearest Prata Wala outlet Prata Wala @ Jurong Point Address: 1 Jurong West Central 3, #01-71, Jurong Point, S(648331) Phone: +65 6795 2530 Operating hours: 5 am – 3 am Prata Wala @ Nex Mall Address: 23 Serangoon Central, #02-17, Nex Mall, S(556083) Phone: +65 6634 2910 Operating hours: 8.30 am – 10 pm Prata Wala @ Tampines Mall Address: 4 Tampines Central 5, #B1-K21, Tampines Mall, S(529510) Phone: +65 6789 1237 Operating hours: 9 am – 10 pm Prata Wala @ Northpoint City Address: 930 Yishun Ave 2, #B1-57, Northpoint Shopping Centre, S(769098) Phone: +65 6481 1297 Operating hours: 9 am – 10 pm  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Fairprice 2-Day Specials: Ferrero Rocher, Buy-2-Get-1-Free Ben & Jerry’s, Thirsty Hippo & More! From 30 Nov – 1 Dec 2019\t", "start": "2019-11-30T00:00:00+08:00", "end": "2019-12-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/11/Fairprice-2Day-Specials-feat-30-Nov-2019-300x157.jpg", "vendor": "NTUC Fairprice", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 2 day Christmas flash sale (30 Nov – 1 Dec) Planning a Christmas holiday gathering? Time to make a list, don’t think twice! Get your hands on these festive deals at a special price when you shop at Fairprice stores and online for these 2 days. *Limited to 4 sets per product per customer, while stocks last. The promotion is also available at Fairprice’s Online store at www.fairprice.com.sg. *Not all products listed are available on FairPrice On. Listed are BEN &amp; JERRY’S Pints Assorted 458ml- 473ml JUST WINE Sauvignon Blanc / Shiraz / Cabernet Sauvignon 750ml U.P. 2 for $59.80 AH HUAT White Coffee Classic 15’s x 30g U.P. 2 for $12.60 FERRERO ROCHER T30 U.P. $18.55 NATURE VALLEY Bars Assorted 252g – 254g U.P. $5.85 NONGSHIM Noodles Mushroom / Claypot / Potato Pork / Kimchi 5’s x 120g U.P. 2 for $8.70 CAMPBELL’S Soup Cream Style Corn With Chicken / Cream Style Corn With Mushroom / Cream Of Mushroom / Cream Of Chicken 290g – 312g U.P. 4 for $6.60 THIRSTY HIPPO Moisture Absorber 7’s x 600ml U.P. 2 for $36.80 BEAUTEX Pure Pulp Bathroom Tissue 10’s x 350 sheets U.P. 2 for $13.40 Click on image to enlarge  Find your nearest Fairprice outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s will be offering 1-for-1 Big Breakfast® from 2 – 5 December 2019\t", "start": "2019-12-02T00:00:00+08:00", "end": "2019-12-05T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/Big-Breakfast-feat-20-Sep-2019-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 Big Breakfast via McDonald’s App This deal is only valid from 2 – 5 Dec 2019, 4am – 11am, while stocks last. Limited to one redemption per day. Big Breakfast®. Freshly scrambled eggs set aside a sizzling sausage, perfectly crisp Hashbrowns and mouth-watering toasted muffins. What more could anyone ask for? Note: Deal may not be available at all outlets, check app for detailed info  Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  Click on image to enlarge  For more info, click here. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " McDonald’s will be offering 1-for-1 6pc Chicken McNuggets® from 8 – 11 December 2019 ", "start": "2019-12-08T00:00:00+08:00", "end": "2019-12-11T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/10/McDonalds-feat-15-Oct-2019-300x157.jpg", "vendor": "McDonald&#39;s", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 1-for-1 6pc Chicken McNuggets® via McDonald’s App!  UPDATE: Extended till 11 December This deal is only valid from 8 – 11 December 2019 while stocks last. Limited to one redemption per day. Chicken McNuggets®. A boxful of bite-sized treats, beautifully battered – good as a quick snack or as part of a hearty meal. Available in 6,9 or 20 piece servings, McDonald’s Chicken McNuggets™ are a childhood favourite that you won’t outgrow. Note: Deal may not be available at all outlets, check app for detailed info   Download via Google Play Store or Apple App Store. Get even better value on all your favourite McDonald’s menu items in four easy steps.  Watch the video to find out how to redeem great app deals, no matter where you are.  Click on image to enlarge  For more info, click here. Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Fairprice 2-Day Specials: 1-for-1 New Zealand Rockit Apples & more deals for 2-days only from 7 – 8 Dec 2019\t", "start": "2019-12-07T00:00:00+08:00", "end": "2019-12-08T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/Fairprice-2Day-feat-7-Dec-2019-300x157.jpg", "vendor": "NTUC Fairprice", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 2 DAYS ONLY 7-8 DECEMBER Good tidings we bring so that’s why we all sing! Come down to Fairprice stores this weekend and enjoy these great deals specially prepared for you. (You can get them online too!) *Limited to 4 sets per product per customer, while stocks last. Return vouchers are only applicable for in store purchases. All other promotions available online and in stores. The promotion is also available at Fairprice’s Online store at www.fairprice.com.sg. *Not all products listed are available on FairPrice On. Listed are New Zealand Rockit Apples 5’s CHANG Canned Beer 6’s x 320ml U.P. $15.45 NESCAFE White Coffee Assorted 15’s x 20g – 36g U.P. 2 for $13.90 QUAKER Instant Oatmeal 800g + 200g/ Quick Cook Oatmeal 800g + 200g/ Whole Rolled Oats 800g U.P. $5.10/$5.35 FAIRPRICE Soft White Facial Tissue 5’s x 200 sheets U.P. 2 for $9.50 VANISH Power 02 Intelligence Stain Remover Powder Pink/White 1.5kg U.P. 2 for $39.90 GLADE Scented Gel Assorted 180g U.P. 5 for $16 LEE KUM KEE Panda Oyster Sauce 51 Og U.P. 2 for $7.40 NARCISSUS Whole Mushroom 425g U.P. 3 for $4.95 Click on image to enlarge  Find your nearest Fairprice outlet here Share this with your friends &amp; family members on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " LiHO Singapore is offering a “Buy One Get One Free” deal at all outlets on 5 December 2019\t", "start": "2019-12-05T00:00:00+08:00", "end": "2019-12-05T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/12/LiHO-Singapore-feat-4-Dec-2019-300x157.jpg", "vendor": "LiHO", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! It doesn’t take a lot to make someone’s day – even a small, thoughtful gesture can go a long way. Even asking your neighbours “How are you?” could brighten up their day. Tomorrow (5 Dec), LiHO Singapore is brightening up our days with a “Buy One Get One Free” deal for all SG Cares app users. Simply download SG Cares app (via Apple App Store or Google Play Store) and flash the app to LiHO counter staff to enjoy this Buy 1 Get 1 Free promotion! Thank you LiHO Singapore for showing us you care and for doing your part to give back during Giving Week! Valid for ALL LiHO drinks at all LiHO outlets. T&amp;Cs apply (refer below) #SGCares #GivingWeekSG  Terms &amp; Conditions Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Qoo10: Grab free $8 cart coupons (usable with min spend $60) valid till 24 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2017/02/Qoo10-28-Feb-2017-300x158.jpg", "terms": "Qoo10 is running a Cross The Hump promotion featuring free cart coupons worth  $8  at www.qoo10.sg till 24 March 2020  Event runs from 23 March 2020 00:00 Hours to 24 March 2020 23:59 Hours Coupons can only be received during the event period $8 Cart Coupon Coupon is applicable with a minimum purchase of $60 Coupon is limited to a total of 20,000 applicants daily Applicants can redeem once only General Event application/purchases are only available within Qoo 10 Singapore (www.qoo10.sg) Entries received after the event period will not be accepted All prizes cannot be exchanged for cash and are non-transferable Qoo10 Singapore reserves the rights to make any amendments to the contest period and mechanics at any point in time without prior notice By participating in the promotion events, you agree to be bound by the Terms and Conditions, the User Agreement and the decisions of Qoo10 Visit www.qoo10.sg for more info Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Department Stores, Online Stores, Online Major Sales Events Events "},
{"name": " Book Depository: 5% OFF storewide coupon code for Mastercard cardholders valid till 14 August 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2017/09/Book-Depository-14-Sep-2017-300x158.jpg", "terms": "Get an extra 5% off already great prices to help you find your new favourite book at The Book Depository www.bookdepository.com/mastercard when you enter the coupon code below The Book Depository – www.bookdepository.com/mastercard – specialises in having one of the largest ranges of books on Earth backed up by free delivery to over 100 countries (including Singapore). The selection features a broad range of books  Using your discount voucher, exclusively available for the Mastercard Overseas Student Education Program, you’ll receive an extra 5% off on already low prices. Terms and Conditions Other terms and conditions apply. function showCouponLink(eg){window.open(eg.href);jQuery('.couponCode').show('slow');jQuery('.couponCode').css('font-size','1.5em');jQuery('.couponCode').css('font-weight','bold');} Visit The Book Depository and reveal the coupon code below Enter this coupon code in the basket (Click box above to reveal):  (Coupon Code 1)  Visit www.bookdepository.com/mastercard for more info Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Books, Magazines, Graphic Novels, Stationery Events "},
{"name": " Adidas S’pore online store is offering free shipping with no min spend or purchase till 31 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Adidas-9-Mar-2020-300x157.jpg", "terms": "Adidas store at www.adidas.com.sg is currently offering free shipping on all orders for the entire month of March, with no minimum spend. Valid until 31st March 2020 No minimum purchase required. Applied automatically at checkout. Free Shipping ends 31st March 2020. Visit www.adidas.com.sg to shop now Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Department Stores, Online Stores, Online Major Sales Events Events "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " HSBC Revolution card – Apply & get a free Samsonite luggage worth S$560! Ends 31 Mar 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/05/HSBC-Revolution-feat-1-May-2019-300x162.jpg", "terms": "Sign up for HSBC Revolution Credit Card at www.hsbc.com.sg and get a Samsonite T5 68cm Spinner with built-in scale (worth S$560) and two years annual fee waiver  The HSBC Revolution Credit Card allows you to enjoy transact online, party and dine your way to a more rewarding life. With so much to sip, savour, and experience, you need a card that lets you live life to the fullest, with great deals and even more rewards. Earn as many Rewards points as you like with no minimum spend required.  Apply online now and enjoy 2 years annual fee waiver, plus an Samsonite T5 68cm Spinner with built-in scale (worth S$560). New customers choose fromSamsonite T5 68cm Spinner with built-in scale (worth S$560)OR $150 cash back Existing CardholderS$30 cash back NEW 1 Aug: Apply online with MyInfo via SingPass and get additional S$20 worth of Grab rides Benefits of HSBC Revolution Card 5x Rewards on online purchases 5x Rewards on local dining transactions 5x Rewards on local entertainment transactions 1x Rewards on all other transactions Golden Village: From SGD7 per ticket onwards at Golden Village with the HSBC Movie Card And many more (ENTERTAINER with HSBC, Travel, etc) Terms &amp; Conditions New Cardholder – Choice of Samsonite T5 68cm Spinner with built-in scale (worth S$560) or S$150 cash backMust not hold any existing HSBC Credit Card*#;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Existing Cardholder – S$30 cash backExisting HSBC Credit Card# must be issued more than 12 months earlier*;Did not cancel any HSBC Credit Card#within last 12 months*; andCharge a minimum of S$800 in Qualifying Transactions from Card Account Opening Date to the end of the following month.*in each case prior to the approval date of their new Card application under this Promotion.#in each case with the exception of HSBC Visa Infinite Credit Card. Further detailed T&amp;Cs can be found here Eligibility requirements All applicants must be at least 21 years of age. For Singaporeans and Permanent Residents, a minimum annual income of S$30,000 is required. For self-employed and foreigners, a minimum annual income of S$40,000 is required. If you do not meet the above income requirements, a minimum Fixed Deposit Collateral of S$10,000 is required. For more info and to apply, visit www.hsbc.com.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Credit Cards, Prepaid Cards, Banks Events "},
{"name": " Bath & Body Works: Buy-3-Get-3-Free storewide Black Friday promo from 29 Nov – 1 Dec 2019\t", "start": "2019-11-29T00:00:00+08:00", "end": "2019-12-01T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/11/Bath-Body-Works-feat-28-Nov-2019-300x159.jpg", "vendor": "Bath & Body Works", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! It’s FREEBIE heaven in stores for this once a year deal! Buy 3 get 3 free entire store. Mix and match From November 29 – December 1 2019. Terms &amp; Conditions Applicable on storewide purchase excluding gift sets &amp; select promotional items. Not valid with any other offer &amp;/or promotion. Single item on regular price. Free items will be the lowest price in the qualifying transaction. Not valid at vie beaute resort world. Valid from 29 Nov – 1 Dec 2019. While supplies last. Other terms &amp; conditions apply.  Find your nearest outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Personal Care, Creams, Soap, Shampoo, Toiletries "},
{"name": " llaollao: 1-for-1 Medium Tubs (Usual Price: $11.80) on 29 November 2019\t", "start": "2019-11-29T00:00:00+08:00", "end": "2019-11-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/11/llaollao-feat-28-Nov-2019-300x157.jpg", "vendor": "llaollao", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! BLACK FRIDAY SPECIAL Black Friday is tomorrow and llaollao is lining up #llaollao Medium Tubs just for you! Enjoy 1-for-1 Medium Tubs (Usual Price: $11.80) tomorrow, 29 November to reward yourselves after the #BlackFriday shopping. Terms and conditions apply. Promotion is valid on: Friday, 29 November 2019 From 12 noon to 8pm Participating Outlets: Bugis Junction, #01-14 Changi Airport Terminal 3, Departure/Check-in Hall North #02-93 IMM Outlet Mall, #01-42 Suntec City, #01-312 Tampines 1, #01-38 Wisma Atria, #B1-64A #llaollaosg #Friday #TGIF #froyo #1for1  Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Tuk Tuk Cha: 1-for-1 Large-sized Thai Milk Tea or Green Milk Tea at all stores on 29 Nov 2019\t", "start": "2019-11-29T00:00:00+08:00", "end": "2019-11-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/11/Tuk-Tuk-Cha-feat-25-Nov-2019-300x158.jpg", "vendor": "Tuk Tuk Cha", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Brace yourself for a 1-or-1 sweet treat coming Black Friday, featuring Tuk Tuk Cha all-time classic favourite Thai beverage. Purchase a Large-sized Thai Milk Tea or Green Milk Tea and enjoy another cup on the house. Simply follow Tuk Tuk Cha on social media and flash this offer to enjoy the deal. Valid on 29 Nov 2019 Friday, all day. Applicable at all Tuk Tuk Cha stores. T&amp;Cs applies. Not applicable in conjunction with any other promotional discount and privileges. Faster jio and tag your friends who love Thai Milk Tea. 😎   Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Delifrance: 1-for-1 Classic Mayo Sandwich Deal from 26 – 29 November 2019 ", "start": "2019-11-26T00:00:00+08:00", "end": "2019-11-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/11/Delifrance-feat-26-Nov-2019-300x159.jpg", "vendor": "Delifrance", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! It’s 1-for-1 November, delightful deals just for you! 1-for-1 Classic Mayo Sandwich Deal Choose from 4 flavours: Egg D’vine, Chicken D’light, Tuna D’licious, Seafood D’sire The Mayo sandwich price ranges from $7.20-$8.20.   Terms &amp; Condition: Limited to 3 sets per customer. No slicing of baguette. Promotion is only valid and redeemable from the above stated dates. Delifrance Singapore reserves the right to substitute the items should they be out of stock with other available items. Delifrance kindly seeks your understanding on the above conditions Find your nearest Delifrance outlet here Share this with your friends &amp; loved ones on Facebook! Apply for the Citi Cash Back Card credit card and get S$120 cash back when you apply and spend! Visit www.citibank.com.sg! ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " J.CO Donuts & Coffee: 1-for-1 beverages on weekdays at Raffles City & Paya Lebar Square outlets from 22 – 29 Nov 2019\t", "start": "2019-11-22T00:00:00+08:00", "end": "2019-11-29T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/J.CO-Donuts-Coffee-feat-9-Sep-2019-300x158.jpg", "vendor": "J.CO Donuts & Coffee", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! J.CO Donuts &amp; Coffee 1 for 1 Happy Hour beverage promotion is back! Buy any beverage and get another for free (Mondays to Fridays, 3pm to 5pm) Available at Raffles City and Paya Lebar Square outlets, Monday to Friday, 3pm to 5pm (4th November 2019 to 19th November 2019 and 22nd November 2019 to 29th November 2019)   Terms &amp; Conditions: Paya Lebar Square Paya Lebar Square 60 Paya Lebar Road, #01-78, 79, K2 Singapore – 409051 Raffles City Raffles City Shopping Mall 252 North Bridge Road, #B1-44L Singapore – 179103  Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Starbucks: Enjoy 1-for-1 on any Venti-sized handcrafted beverages from 26 – 28 November 2019\t", "start": "2019-11-26T00:00:00+08:00", "end": "2019-11-28T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/09/Starbucks-feat-13-Sep-2019-300x157.jpg", "vendor": "Starbucks", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Starbucks Happy Hour Treat returns once again – Enjoy 1-FOR-1 Venti-sized beverages between 26 – 28 November 2019, 3 – 7pm at ALL outlets!  From 26-28 Nov, 3-7pm, treat yourself to any Venti-sized handcrafted beverage and enjoy another on the house (buy one get one free). T&amp;Cs apply.  Terms &amp; conditions Valid from 26-28 Nov 2019 (Tue-Thu), 3-7pm on any Venti-sized handcrafted beverage at all Starbucks Singapore stores, except selected Nitro beverages and ice cream beverages. Limited to 2 redemptions per transaction. While stocks last. Lower-priced drink (including customizations, if any) will be free. Stars for Rewards Redemption cannot be used in conjunction with this offer. Not applicable on Mobile Order &amp; Pay and delivery orders. Not valid with any other promotions or privileges. Other terms and conditions apply.  There’s something about drinking coffee this time of year. It just tastes better. Maybe it’s that the holidays give us permission to get excited about the small stuff. Here’s the enjoying the small, good stuff. Mmm, Toffee Nut Crunch Latte, so luxuriously buttery and sweet. Starbucks signature espresso is combined with steamed milk and toffee nut sauce before being topped with whipped cream and crunchy toffee nut bits. Sipping one feels like a big, warm hug. Available hot, iced and blended. Hot and cool at the same time, the Peppermint Mocha is like a party for your taste buds. This holiday classic is made with Starbucks signature espresso, steamed milk, sweet mocha sauce and peppermint-flavored syrup. It’s all topped off with whipped cream, a dash of mocha drizzle and crunchy red and white candy bits. Available hot, iced and blended. Rich, smooth, and oh-so-festive. This creamy beverage brings together Starbucks signature espresso and creamy French Vanilla flavor before being topped with smooth butterfly pea cold foam. The drink is then finished with festive blue and white sprinkles. Available hot, iced and blended. Merry Coffee. Find your nearest Starbucks store here. View the Starbucks beverage menu here. Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " SUKI-YA: 1-for-1 Shabu Shabu dinner at Bugis+ from 18 – 24 November 2019\t", "start": "2019-11-18T00:00:00+08:00", "end": "2019-11-24T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/04/SUKIYA-3-faet-15-Apr-2019-300x154.jpg", "vendor": "Bugis+", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Say “Y E S” to Suki-Ya’s 1-FOR-1 ALL YOU CAN EAT SHABU SHABU DINNER Happening 18 – 24 November 2019 at Suki-Ya Bugis+, #04-14/15! Clock is ticking so hurry and call a pal down and feast! This “House of Hot Pot” is designed to offer heart-warming dining experiences at equally affordable prices. Diners enjoy unlimited, top-quality chilled beef and pork in paper-thin slices and farmed chicken that are oh-so-delicious in their own right. Another highlight of Suki-Ya is its vegetable bar featuring a wide variety of fresh vegetables to round up the meal with a healthy touch. Along with sumptuous soups and broths, dining at Suki-Ya is bound to perk up everyone’s taste buds!     Check out the menu and pricing below   Terms &amp; conditions *Valid with a min purchase of 1 drink per diner. Valid at Suki-Ya Bugis+ only. Valid 18 – 24 November 2019, 4pm – 9.30pm (60 mins) only. Last order at 9.30pm. 60 minutes begins from the time you are seated. Dinner is $24.90++/pair on Monday – Thursday and $27.90++/pair on Friday – Sunday. (Regular pricing applies for individuals who are not in pairs). Promotion valid on buffet only. Not valid with any additional add-ons or ala carte drinks (e.g. Beer, Sake, Water). Limited to 2 redemptions (4pax) per bill/table. No splitting of bill/table allowed. Not valid with any other promotions, discounts, offers, dining apps or any card privileges (e.g. SAFRA Card, Credit Card). Only walk-ins accepted. Valid for dine-in only, not valid for take-aways. Item of equal or lower value will be complimentary. Management reserves the right to amend any dishes, prices and terms and conditions without prior notice. © 2019 The Coca-Cola Company. ‘Coca-Cola’ and ‘Sprite’ are registered trademarks of The Coca-Cola Company. Outlet details BUGIS + #04-14/15 201 Victoria Street Singapore 188067 Tel: 6884 5778  Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Watsons: Buy-1-Get-1-Free (1 FOR 1) on selected Watsons Brand, Pure’n Soft & Orita products on 13 Nov 2019\t", "start": "2019-11-13T00:00:00+08:00", "end": "2019-11-13T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2016/07/Watsons-Feat-13-Jul-2016-300x147.jpg", "vendor": "Watsons", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! For one day only on 13 Nov 2019, enjoy 1-for-1 (buy 1 get 1 free) on participating products across Watsons Brand, Pure’n Soft and Orita  Click on image to enlarge  Terms &amp; conditions All promotions are valid on 13 Nov 2019 only, unless otherwise stated. Free item has to be lower or equal value and within the same product range featured. Not valid for new, promotional items, pack sets and $2 buys. While stocks last. Products featured are available at selected stores. Prices are subjected to change without prior notice. All information is correct at time of printing. Terms and conditions apply. Find your nearest Watsons outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. "},
{"name": " Cotton On: 30% OFF almost everything at online store till 24 March 2020 ", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Cotton-On-20-Mar-2020-300x158.jpg", "terms": "Enjoy 30% off almost everything online (Women, Men, Kids, Typo, Body, Rubi, etc) at Cotton On‘s online store at cottonon.com/SG.  UPDATE: Extended till 24 March FREE shipping on Singapore orders over S$50. No code required.  Free returns in-store. Born to deliver on-trend, effortlessly cool and affordable fashion, Australian brand Cotton On provides women and men the styles they want now. Cotton On is proud to be exporting the laid-back, quintessential modern Australian style to the world. Shop Cotton On Kids for the latest trends in kids clothing at affordable prices from sizes new baby to age 14. Discover on trend clothing for baby, girls, boys, accessories, bedding and kids room. Cotton On Body is a global lifestyle brand with intimates, active, sleep, lounge and swimwear. Their product is designed with their girl always in mind. She believes in a balanced healthy life and loves that Cotton On’s product empowers her to perform at her best, be happy and feel confident. Rubi is leading the way as the go to brand for the most on trend footwear and accessories. It has something for every girl, everywhere, everyday. Typo is a gift store full of traditional and unique items 锟? with a twist! The Typo range includes homewares, wall art, decor, stationery, party accessories, travel and tech accessories, art and craft projects and of course gifts and cards for every event Terms &amp; conditions ONLINE EXCLUSIVE 30% Off selected full price styles. Offer applies to Cotton On Women’s, Cotton On Men, Cotton On Kids, Cotton On Body, Rubi and Typo. Offer excludes Sale, Cotton On Foundation and Gift Cards. Discount to be reflected at the checkout. Offer available exclusively online at cottonon.com/SG, for a limited time only. Individual prices as marked. Cannot be used in conjunction with any other subscriptions, coupons and promo codes. Visit cottonon.com/SG for more info Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. "},
{"name": " Fairprice: Ben & Jerry’s ice cream pints including the new “Chip Happens” flavour are going at 2-for-$19.90 (U.P. $27.80) till 25 March 2020\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Fairprice-Ben-feat-19-Mar-2020-300x157.jpg", "terms": "Stock up on Ben &amp; Jerry’s ice cream with NTUC Fairprice’s latest weekly promotion. The new “Chip Happens” Netflix flavour is described as “a cold mess of chocolate ice cream with fudge chips and crunchy potato chip swirls”. Grab two tubs of Ben &amp; Jerry’s assorted for $19.90 (usual $27.80) That’s about $9.95 per tub. Limited to 6 units per purchase The promotion is also available at Fairprice’s Online store at www.fairprice.com.sg. *Not all products listed are available on FairPrice On. Click on image to enlarge  Find your nearest Fairprice outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Delifrance has a 1-FOR-1 French Butter Croissant deal on Qoo10 (From 17 March 2020)\t", "image": "https://cdn.singpromos.com/wp-content/uploads/2020/03/Delifrance-feat-17-Mar-2020-300x157.jpg", "terms": "1 FOR 1 Butter Croissant. Baked freshly using the finest French butter, flour, and the authentic French style baking process, they have a uniquely French aroma that cannot be matched by others. Terms &amp; Conditions: Valid till 30 Apr 2020. Redemption at Delifrance Outlets. Check in-store on availability. Q-Price: S$6.40 Time Sale Price: S$2.90   For more info and to buy, visit the deal page at www.qoo10.sg. Share this with your friends &amp; family members on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "},
{"name": " Levi’s: Buy 1 Get 1 Free for all regular-priced apparel exclusively at OG People’s Park from 23 – 24 Nov 2019\t", "start": "2019-11-23T00:00:00+08:00", "end": "2019-11-24T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/11/Levis-feat-21-Nov-2019-300x156.jpg", "vendor": "OG People&#39;s Park", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! Levi’s Promo Returns!  This time exclusively at OG People’s Park! Buy 1 Get 1 Free for all Levi’s regular-priced apparel! EXTRA GIFTS for the first 100 customers in line from 11am this weekend (23 &amp; 24 Nov) at OG People’s Park, Basement 1, Levi’s counter! Gifts range from Levi’s jeans or tee of your choice, to exclusive Levi’s wallet or Hello Kitty Tote Bag! T&amp;Cs apply. More info here: bit.ly/2qtnzIJ  Venue OG PEOPLE’S PARK 100 Upper Cross Street Singapore 058360 Tel: (65) 6535 8888 | Fax: (65) 6535 7788 Daily: 1100 ~ 2130  Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fashion, Branded Apparel, Wallets, Accessories "},
{"name": " Fairprice 2-Day Specials: Redondo, Milo, 1-For-1 LINDT Lindor Cornet & More! From 23 – 24 November 2019\t", "start": "2019-11-23T00:00:00+08:00", "end": "2019-11-24T23:59:59+08:00", "image": "https://cdn.singpromos.com/wp-content/uploads/2019/11/Fairprice-2Day-Specials-feat-2-23-Nov-2019-300x157.jpg", "vendor": "NTUC Fairprice", "terms": "Oh no, the event has ended. Don't miss out again, get the latest sales via our newsletter, Facebook, Twitter or RSS feed! 2 DAYS ONLY 23 – 24 November  Christmas comes early this season with these festive specials at Fairprice stores and online. Embrace the spirit of giving by sharing this with your friends! *Limited to 4 sets of each product per customer, while stocks last. The promotion is also available at Fairprice’s Online store at www.fairprice.com.sg. *Not all products listed are available on FairPrice On. Listed are FRESH Blueberries 125g U.P. 3 for $10.50 VINA MAIPO Classic Series Sauvignon Blanc Chardonnay/Cabernet Sauvignon Merlot/Syrah Cabernet Sauvignon 750ml U.P. 2 for $48 MILO Ready-To-Drink 4 x I5s + 1’s FREE) x 200ml U.P. $14.20 NESCAFE Original/Less Sugar/ Zero Sugar/ Brown Sugar 35’s/30’s x 9g-19g U P. 2 for $12.30 LINDT Lindor Cornet Assorted 200g REDONDO Xmas Design Wafers Chocolate / Cookies &amp; Cream 100g U.P. 2 for $4.50 OREO Single Serves Assorted 9’s U.P. 2 for $3.90 NISSIN CQYD Instant Noodles Chicken/Sesame Oil/ Spicy Sesame/ Garlic Chicken 5sx81g -86g U.P. 2 for $4.60 COLGATE Total 12 Toothpaste Pro Whitening Gel/Clean Mint Paste/ Professional Clean Gel/ Charcoal Deep Clean Paste 150g U.P. 3 for $17.85 FAIRPRICE GOLD Facial Tissue 3-Ply 4’s x 140 sheets U.P. 3 for $13.50 Click on image to enlarge  Find your nearest Fairprice outlet here Share this with your friends &amp; loved ones on Facebook! Get a FREE Samsonite T5 Spinner luggage with built-in scale worth S$560 (with min spend of $800) plus 2-years annual fee waiver when you sign up for a HSBC Revolution credit card at www.hsbc.com.sg. ", "category": "Events Fast Food, Restaurants, Dining, Groceries "}
]